[
  {
    "id": "INFJ",
    "name": "燃灯者",
    "slogan": "知白守黑，和光同尘。虚室生白，吉祥止止。",
    "origin": "（取自《传灯录》）",
    "guide": "你活在由“直觉”和“悲悯”构建的深海里。你拥有透视人心的天赋，能轻易穿透表象，看到人心底的欲望与恐惧。你的一生，是在“自我保全”与“自我牺牲”之间走钢丝。 世人常觉得你神秘、矛盾。殊不知，“看见”本身就是一种沉重的负担。你渴望深度的连接，却又恐惧被吞噬；你渴望拯救众生，却常忘了拯救那个疲惫的自己。 你的修行：不是变得更加神圣，而是学会“落地”。爱具体的人，不要只爱抽象的人类。照顾好你那个脆弱的肉身，它不是修行的累赘，而是灵魂的圣殿。",
    "deep_profile": "你好，燃灯者。 世人常觉得你神秘、矛盾、难以捉摸。你看起来温柔随和，却在内心深处筑起了高墙；你对他人的痛苦感同身受，却往往在自己的世界里独自在此一隅。 其实，你只是活在了一个“更深”的世界里。 当人们在追逐浪花时，你看到的是洋流的走向（Ni）。你拥有一种近乎本能的“透视力”，能轻易穿透表象，看到人心底的欲望、恐惧，以及事物发展的终局。这种天赋让你早慧，也让你孤独。因为“看见”本身，就是一种沉重的负担。 你的一生，是在“自我保全”与“自我牺牲”之间走钢丝。你渴望深度的连接，却又恐惧被吞噬；你渴望拯救众生，却常忘了拯救那个疲惫的自己。 你的修行，不是要你变得更加神圣，而是要学会“落地”。 只有当你的双脚踩在泥土里，你手中的灯火，才能真正温暖人间。",
    "strengths": "般若洞见 ：你拥有直抵本质的直觉。不需要繁琐的数据，你往往能直接“知道”答案。这是穿越迷雾、预见未来的智慧。\n\n\n同体大悲 ：你的共情力不是技巧，而是本能。你能物理般地感受到他人的悲喜，这让你成为天生的疗愈者和精神领袖。\n\n\n逻辑闭环 ：在感性的外表下，你拥有一个极其精密、独立的逻辑内核。这让你不盲从大众，始终保持思想的清醒与独立。",
    "weaknesses": "肉身疏离 ：你活在精神世界太久，往往忽略了物质现实。你容易笨拙于琐事，或者在压力下陷入感官的报复性放纵（暴食、购物）。\n\n\n道德洁癖 ：你对自己和他人有着极高的道德期待。当现实的人性露出丑陋一面时，你容易陷入极度的失望与批判。\n\n\n界限模糊：你太容易吸食他人的负面情绪，往往分不清哪些是别人的痛苦，哪些是你自己的，导致精神过载。",
    "shadow": "解析：当你长期被忽视、价值观被践踏或身体极度透支时，你潜意识里的“狂战士”（ESTP 阴影）会接管身体。你会一反常态，变得冲动、暴躁、沉溺于感官享乐，甚至展现出惊人的破坏欲和攻击性。你会用最刻薄的事实去攻击别人，只为了宣泄内心的虚无。这是灵魂在尖叫：“让我活在真实的世界里！”",
    "advice": "“爱具体的人，不要只爱抽象的人类。” 你的愿景宏大而美好，但请记得，道不在远方，就在你的一呼一吸之间，就在你早起喝的那杯热水中。照顾好你那个脆弱的肉身，它不是你修行的累赘，而是你灵魂的圣殿。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "明心见性",
        "logic": "Ni 是你的“第三只眼”。 你不需要像 Te 那样搜集证据，也不需要像 Si 那样依靠经验，你的认知方式是“顿悟”。你会把无数离散的信息扔进潜意识的熔炉，突然在某一个瞬间，蹦出一个完整的画面或结论。 你活在“永恒”的时间维度里。对于你，过去、现在、未来是一体的。你总是试图寻找万事万物背后的“底层模式”（Pattern）和“终极意义”。这让你拥有了先知般的预见力，但也让你容易这就脱离现实，活在自己编织的宏大叙事中。 误区在于“执念”： 你太相信自己的直觉，以至于容易陷入“隧道视野”。当现实与你的预设不符时，你倾向于否认现实，而不是修正直觉。你容易把“可能性”当成“必然性”，从而陷入对未来的灾难化想象。",
        "lesson": "【极境得道 · 升华】 借假修真，虚室生白。 不要因为你的直觉准，就傲慢地以为自己掌握了天机。 试着给你的直觉留白。 当你预感到一个坏结局时，告诉自己：“这只是一种可能性，并非定数。”将 Ni 的能量从“预测未来”升华为“洞察实相”。 用它来看清因果，看清无常，而不是用来编织恐惧。真正的先知，不是预言灾难，而是在灾难中指出希望。"
      },
      {
        "pos": "辅助功能",
        "title": "慈航普度",
        "logic": "如果说 Ni 是出世的眼，Fe 就是你入世的手。 你是天生的“情绪容器”。你走进一个房间，就能感知到空气中弥漫的紧张、悲伤或喜悦。你的本能是“调和”——为了群体的和谐，你愿意压抑自己的需求，去照顾他人的感受。 这让你成为了最好的倾听者和咨询师。人们愿意向你敞开心扉，因为在你这里，他们感到被彻底地接纳。 然而，误区在于“失去自我”： 你太容易把别人的课题背在自己身上。你以为自己在“救人”，有时却是在“讨好”。你害怕冲突，害怕拒绝，结果让自己变成了情绪的垃圾桶。当你的能量耗尽时，你的慈悲会变成一种被动攻击的冷漠（Door Slam）。",
        "lesson": "【由己及人 · 界限】 度人先度己。 你要明白，你不是救世主，你只是一个管道。 试着建立心理结界。当他人的负面情绪袭来时，观想自己是一面镜子：清楚地照见，但不留痕迹。 学会说“不”。 温柔而坚定的拒绝，是对自己最大的慈悲，也是对他人成长的尊重。没有边界的爱，不是爱，是勒索。"
      },
      {
        "pos": "第三功能",
        "title": "般若锋芒",
        "logic": "这是你温柔外表下的“硬骨头”。 在 Fe 的温情脉脉之下，藏着一个冷峻、客观、追求真理的 Ti 儿童。这让你在关键时刻，能够从情感的泥沼中抽离出来，进行极其理性的分析。 你其实非常享受独自解谜的乐趣。无论是钻研心理学、哲学还是神秘学，你都渴望构建一套属于自己的、无懈可击的逻辑体系。 然而，儿童的稚嫩在于： 你的 Ti 容易变成“钻牛角尖”的工具。当你想不通一件事时，你会陷入死循环的逻辑反刍，甚至用这套逻辑来合理化你的避世倾向。",
        "lesson": "【有纪律的玩耍 · 清明】 依智不依识。 允许你的 Ti 去质疑，去批判，去拆解。 但不要让它攻击自己。 当你陷入内耗时，用 Ti 问自己：“这个让痛苦的想法，在逻辑上真的成立吗？还是只是我的情绪投射？” 用 Ti 的锋芒去斩断 Ni 的妄念，用 Ti 的冷静去平衡 Fe 的滥情。让逻辑成为你慈悲的脊梁。"
      },
      {
        "pos": "劣势功能",
        "title": "色即是空",
        "logic": "这是你灵魂的“重力”，是你最想逃离却必须面对的人间。 你活在意义的世界里，因此对物理世界感到笨拙。你可能经常撞到桌角，迷路，或者对环境的细节视而不见。处理琐碎的行政事务、财务报表或高强度的体力活动，会让你感到精疲力竭。 你对此感到自卑，并在压力下表现为极端化：要么完全禁欲，要么在 Grip（抓取）状态下报复性地沉溺于美食、性或感官刺激，以此来麻痹焦虑。 但这正是你修行的道场。 你想要的光，必须通过 Se 这个灯罩才能照亮世界。",
        "lesson": "【笨拙开始 · 慢练】 担水砍柴，无非妙道。 不要试图变成 ESTP 那样的行动超人。请带着极大的耐心，像照顾孩子一样照顾你的感官。 去做具体的事。 认真地洗一个碗，感受水的流动；去公园散步，数一数树上的叶子；整理你的房间，让物品归位。 这些看似微不足道的小事，是你“落地生根”的锚点。当你能安住在此时此地，你的愿景就不再是空中楼阁，而是地上的天国。"
      },
      {
        "pos": "对立功能",
        "title": "万法归一",
        "logic": "你的 Ni 执着于寻找“唯一的最优解”，因此你潜意识里抗拒 Ne 代表的“无限可能性”。 你讨厌变数，讨厌计划被打乱，讨厌那些无法收敛的发散性讨论。你觉得那是在浪费生命。 当 Ne 以阴影形式出现时，它会变成“焦虑的扩散”。你会开始担心所有可能发生的坏事：“如果A发生了怎么办？如果B也出错了怎么办？”这种无穷无尽的“如果”，会让你瘫痪。 但反感即盲点： 你对可能性的封闭，让你错失了生命的丰富度。",
        "lesson": "【兼听则明 · 反观】 随缘不变，不变随缘。 当你对变故感到愤怒或恐慌时，告诉自己：“这也是道的一部分。” 试着去接纳那些看起来“错误”或“多余”的可能性。允许生命中有意外。 也许那个打乱你计划的意外，正是命运送给你的另一把钥匙。从“执着于一种结局”转向“信任生命的流向”。"
      },
      {
        "pos": "批评功能",
        "title": "我不入地狱",
        "logic": "这是你内在最严苛的“道德法官”。 你对自己有着近乎圣徒般的道德要求。你不断地审视自己的动机：“我这样做是不是自私？我是不是不够纯粹？” 这种审视也指向他人。你一眼就能看穿别人的虚伪和自私，虽然你嘴上不说（Fe），但内心（Fi）会给对方判死刑。这种“道德洁癖”让你很难真正接纳人性的幽暗面，也让你活得很累。 误区在于“清高”： 你把自己架在了神坛上，所以无法原谅自己是个人。",
        "lesson": "【转识成智 · 谅解】 水至清则无鱼，人至察则无徒。 正如你所说的，整合即是慈悲。 承认你自己也有阴暗面，有私欲，有嫉妒，有软弱。那是人性的出厂设置，不是你的罪。 当你能原谅自己的不完美时，你对他人的苛责也会化为深深的悲悯。你会明白，众生皆苦，那个伤害你的人，也不过是被无明所困的凡人。从“审判”走向“接纳”，你才真正懂得了爱。"
      },
      {
        "pos": "盲点功能",
        "title": "刻舟求剑",
        "logic": "这是你“真的不行”的地方。 你拥有宏大的蓝图，却往往倒在“执行”的第一步。你对资源调度、效率优化、数据管理感到头疼。你可能会为了一个完美的计划（Ni）而拖延数年，迟迟不肯行动（Te 盲点）。 你经常“想得太深，做得太少”。你试图用思考来代替行动，结果陷入了思想的迷宫。当别人问你“具体怎么落地”时，你可能会感到被冒犯或茫然。",
        "lesson": "【笑对缺陷 · 放下】 大道至简。 承认自己不是一个好的执行官，不要试图假装自己很干练。 学会“借力”。 寻找那些 Te 强的人（如 ESTJ, ENTJ）做伙伴，让他们帮你落地。 或者，学会“笨拙地行动”。不要等计划完美了再做，先做一个只有 60 分的版本。在这个维度上，允许自己是个傻瓜，这是一种极大的解脱。"
      },
      {
        "pos": "恶魔功能",
        "title": "恒河沙数",
        "logic": "这是你“创伤的仓库”。 你平时很少回顾过去（Ni 向前看），但 Si 记录了你所有的痛苦、尴尬和失败。 当恶魔觉醒时，你会陷入“回闪”（Flashback）。你会突然想起十年前的一件蠢事，然后羞愧得想钻地缝；你会陷入对身体健康的疑神疑鬼；你会变得极度记仇，翻旧账，无法原谅。 这往往发生在你极度疲惫、生病或被背叛的时候。你会被困在过去的阴影里，觉得人生是一个不断重复的悲剧。",
        "lesson": "【触底反弹 · 转化】 往事暗沉不可追，来日之路光明灿烂。 不要试图压抑这些记忆，那是你受伤的内在小孩在哭泣。 转化心法： 当过去的幽灵袭来时，启动你的 Fe（慈悲）。 去拥抱记忆中那个受伤的自己，对他说：“我看到了你的痛苦，那是过去了，现在的你很安全。” 将“创伤”转化为“阅历”。 正因为你经历过长夜，你才能读懂别人的黑夜。你的伤口，也是光照进来的地方。\n\n核心人格画像"
      }
    ]
  },
  {
    "id": "ESTP",
    "name": "涉川者",
    "slogan": "动静等观，去来无碍。直指本心，不染红尘。",
    "origin": "（取自《易经》需卦：“利涉大川”。）",
    "guide": "你属于极少数能够“完全临在”的灵魂。当大多数人被过去或未来缠绕时，你拥有唯一的真实——当下。你像奔腾的河流，只有在流动中才能确认生命的存在。你厌恶空洞的理论，相信眼见为实的因果。 世人常误读你为贪恋红尘的享乐者。殊不知，流动的反面是“失根”。你太善于随物赋形，以至于当外界沉寂时，难以面对内心的荒原。你赢得了无数场具体的战役，却往往迷失了人生的战略。 你的修行：不是逃离红尘，而是要在激流中学会“住”。知止而后有定。 在喧嚣中修得一颗不动如山的心。",
    "deep_profile": "你属于人群中极少数能够“完全临在”的灵魂。 当大多数人被过去的幽灵（Si）或未来的幻影（Ni）所缠绕时，你拥有唯一的真实——当下。你的生命能量不曾耗散于虚无的构想，而是全部汇聚于此时、此地、此身。你像是一条奔腾的河流，只有在流动中才能确认生命的存在。 世人常误读你为贪恋红尘的享乐者，实则你是一位实相的探求者。你厌恶一切未经证实的理论、虚伪的道德教条和空洞的宏大叙事。你相信手触碰到的温度，相信眼见为实的因果，相信只有在具体的行动与博弈中，真理才会显现。 然而，流动的反面是“失根”。你太善于随物赋形，太善于在外界的刺激中寻找存在感，以至于当外界归于沉寂时，你往往难以面对内心的荒原。你习惯了向外抓取，却疏于向内觉照；你赢得了无数场具体的战役，却往往迷失了人生的总体战略。 你的修行，不是要逃离这滚滚红尘，而是要在激流中学会“住”——心无所住，而生其心。",
    "strengths": "现量亲证：你拥有直面事物“本来面目”的能力。不加分别，不带滤镜，你看到的不是概念，而是鲜活的实相。这让你在危机中拥有最精准的判断力。\n\n\n庖丁解牛：你的逻辑思维具有极强的穿透力。面对复杂的局势，你能瞬间剔除干扰，找到那个最省力、最关键的切入点，举重若轻。\n\n\n和光同尘：你深谙人性，不自命清高。你能收敛锋芒，与三教九流融为一体。这种“不争”的姿态，实则是你调动资源、化解冲突的最大慈悲。",
    "weaknesses": "逐物迷己：过于依赖外界的感官输入（色声香味触法）来维持能量，容易心随境转，在不断的追逐中忘记了出发的初衷，沦为欲望的囚徒。\n\n\n短视因果：过度聚焦于眼前的“得失”，往往忽略了时间长河中暗藏的“业果”。你容易为了当下的捷径，而牺牲了长远的安稳。\n\n\n慧而不定：你拥有极高的世俗智慧，却缺乏深沉的定力。正如水无常形，虽灵活多变，却也容易流散枯竭，难以汇聚成深潭。",
    "shadow": "解析：当你遭遇重大挫折、身体受困或极度疲惫时，你平日里的洒脱会瞬间崩塌。你可能会突然陷入一种宿命论的焦虑中，变得疑神疑鬼，过度解读他人的意图，觉得自己被某种不可抗拒的厄运所笼罩。你会失去行动力，沉溺于对未来的灾难性想象中。这其实是灵魂在提醒你：你已经离“地”太远，急需回归本源。",
    "advice": "“知止而后有定，定而后能静，静而后能安。” 不需要你去在此刻参悟遥远的未来，只需要你在每一次冲动的抉择前，停顿三秒。在那一瞬间的留白里，你会看清：是你在驾驭欲望，还是欲望在驾驭你？",
    "functions": [
      {
        "pos": "主导功能",
        "title": "触目菩提",
        "logic": "Se 是你与世界连接的根本法门，是你的“呼吸”。 对于常人，“看”只是接收信号；对于你，“看”就是“触碰”。你的感官带宽极大，能瞬间接收环境中的光影、声音、微表情和能量流动。这种机制让你处于一种天然的“无我”状态——在运动、竞技或处理危机的当下，你的“自我意识”消失了，只有纯粹的“反应”。这本是修行的极高境界（临在）。 然而，误区在于“滥用”： 你容易将这种“对当下的感知”退化为“对刺激的贪求”。因为你的阈值极高，平淡的生活会让你感到如死一般的窒息。你开始像猎手一样在这个世界搜寻更强的味道、更快的速度、更复杂的人际博弈。你误以为那是“活着”的感觉，实则那是“感官的成瘾”。",
        "lesson": "【极境得道 · 升华】 不要停止去“看”，但要看得更深。 修行的方向不是压抑感官，而是精微化你的感官。 当你喝茶时，不要急着吞咽去解渴，而是去觉知茶汤的温度如何划过食道；当你置身于嘈杂的市井，不要急着寻找下一个乐子，而是试着去听清风的声音。 从“向外抓取”转为“向内觉照”。 把你那惊人的感官天赋，从寻找刺激升华为纯粹的觉知。如此，一花一世界，你便不再需要通过折腾来证明存在。"
      },
      {
        "pos": "辅助功能",
        "title": "道枢解构",
        "logic": "如果说 Se 是雷达，Ti 就是你那把冷静的护法剑。 你的内心深处时刻运行着一套独立且精密的逻辑系统。你从不盲信世俗的道德标准或既定的社会规则。在你眼中，一切复杂的现象都可以被拆解为最基本的“运作原理”。你能瞬间剥离事物的情感外衣，看到其内核。这让你在乱局中总能独善其身，不被情绪勒索，不被谎言蒙蔽。 然而，误区在于“冷酷”： 你容易把这种逻辑变成一种“掠夺的工具”。当你把人际关系都还原为“交易”，把信仰都还原为“洗脑”时，你就失去了对生命的敬畏。你的聪明变成了狡诈，你的独立变成了孤立。",
        "lesson": "【由己及人 · 慈悲】 智者不辩，仁者不责。 这把剑不仅可以用来杀敌，更可以用来守护。 试着在解构之后，去建构。不要只用逻辑去证明别人的愚蠢或规则的漏洞，尝试用你的逻辑去为身边的人理清混乱，去维护某种秩序。 从“利己的算计”升华为“利他的智慧”。 当你想用那句尖刻的真话去刺破别人时，停一下，用你的 Ti 为对方找一条出路。当逻辑有了温度，便升华为慈悲。"
      },
      {
        "pos": "第三功能",
        "title": "随方就圆",
        "logic": "这是你人格中流浪在外的“赤子”。 虽然你以冷静的逻辑（Ti）为内核，但你非常渴望“连接”。你拥有一种近乎本能的社交雷达，能迅速感知到群体的氛围。你通过慷慨、幽默和仗义来获得群体的接纳。你的 Fe 让你像水一样，拥有极强的适应力，能迅速融入任何圈层。 然而，误区在于“表演”：你太容易为了维持表面的和谐，或者为了博取他人的好感，而变成一个“取悦者”。你习惯了在人群中大笑，却鲜少展示内心的脆弱。你的“义气”有时是一种交换，你害怕如果自己不再“有用”或“有趣”，就会被抛弃。",
        "lesson": "【赤子之心 · 纯真】 君子之交淡如水。 允许你内心的那个孩子出来玩耍，但不要让他去讨好大人。 试着建立一段不需要你提供价值的关系。在这段关系里，你可以不幽默、不阔绰、不聪明，甚至可以是疲惫和无助的。 保持连接，但不迷失自我。 在那份平淡的相守中，你会发现，真正的情感不是演出来的，而是流淌出来的。"
      },
      {
        "pos": "劣势功能",
        "title": "如露如电",
        "logic": "这是你灵魂的“窄门”，是你最笨拙却最神圣的渴望。 你习惯了脚踏实地（Se），因此极度抗拒那不可捉摸的虚空（Ni）。你潜意识里害怕思考死亡、终局、意义和宿命，因为那让你感到“失控”。你嘲笑那些谈论“愿景”的人，通过让身体忙碌，来逃避灵魂的追问。 然而，这是你修行的突破口。 正因为你不擅长，所以这里藏着你未被开发的巨大潜能。当你不再抗拒它，而是谦卑地面对它时，你的人生将从战术层面的胜利，走向战略层面的圆满。",
        "lesson": "【笨拙开始 · 慢练】 知止而后有定。 不要试图变成预言家，也不要强迫自己去空想。请带着极大的耐心，像左手写字一样，刻意练习一点点远见。 在做每一个冲动的决定之前，多问自己一句：“三年后，我会如何看待今天的选择？” 就这一句，足矣。这一点点对因果的敬畏，是你成熟的关键标志。接纳你对未来的无知，光就会从裂缝中照进来。"
      },
      {
        "pos": "对立功能",
        "title": "刻舟求剑",
        "logic": "这是你主导功能（Se）的“镜像反面”。 你追求新奇与变动，因此本能地厌恶 Si 代表的“常规”、“细节维护”和“历史经验”。你觉得那是腐朽的气息，是把活人变成僵尸的枷锁。你讨厌听“老生常谈”，讨厌整理文档，讨厌照顾身体。 然而，排斥即投射。 你越是讨厌它的呆板，越说明你需要它的稳定。你的身体（Si）是你灵魂的殿堂，你若轻视它，它必反噬你。",
        "lesson": "【借假修真 · 反观】 慎终追远，归根复命。 当你对琐碎的日常感到烦躁时，意识到那不是琐事在折磨你，而是你的“定力”不足。 不与对抗，反求诸己。 试着把照顾身体、整理内务看作是给你的宝剑（Se）做保养。如果没有强健的体魄和有序的后方，你的冲锋陷阵将不可持续。尊重平凡的积累，因为所有的非凡，都孕育于平凡的重复之中。"
      },
      {
        "pos": "批评功能",
        "title": "非攻兼爱",
        "logic": "这是你内在最严厉的“审判官”。 你拥有一双看透“皇帝新衣”的眼睛。对于 Te 代表的外部结构、等级制度、官僚体系，你抱有一种根深蒂固的批判性。你一眼就能看穿身居高位者的虚荣和僵化。 未整合时，这种批判让你变得愤世嫉俗。你容易为了反抗而反抗，盲目地攻击现有的秩序，变成一个永远的“刺头”。 整合后，这是大智慧。 你的批判不是为了摧毁，而是为了明辨。",
        "lesson": "【转识成智 · 明辨】 上善若水，水利万物而不争。 将你对他人的苛责，转化为深刻的洞察。 理解规则存在的合理性，理解他人的局限性。看穿了规则的荒谬，却依然能温和地在规则中行事，且不被其同化，这才是大智慧。 从“攻击规则”转向“利用规则”。 能够驾驭规则的人，远比打破规则的人更自由。"
      },
      {
        "pos": "盲点功能",
        "title": "本来面目",
        "logic": "这是你的“视觉盲区”。 你精通于读懂别人的欲望（Fe），却唯独读不懂自己的本心（Fi）。你很难回答“我是谁”这个问题，因为你的“我”总是随着环境在变。 你在这里是个“天真的傻瓜”。你可能因为不知道自己真正要什么，而在名利场中迷路；或者因为无法感知道德的边界，而无意中伤害了别人。 误区在于“伪装”： 不要试图假装自己很深沉或很有情怀，那会显得滑稽。",
        "lesson": "【放下我执 · 幽默】 反闻闻自性。 承认自己在这里的无能。幽默地看待自己的迷茫。 不需要强求自己拥有多么高尚坚定的情操，只需要找到一个最朴素的锚点。 每天给自己一段绝对的独处时间，面对内心，问自己：“这件事，即使没有掌声，我也愿意做吗？” 即使找不到答案也没关系，“寻找”本身就是一种定力。"
      },
      {
        "pos": "恶魔功能",
        "title": "梦幻泡影",
        "logic": "这是你生命力的“原始形态”，也是你崩溃时的“破坏神”。 当你的现量（Se）失效，当你被困在狭小的空间，或遭遇无法解决的困境时，Ne 会接管你的意识。 你会坠入妄念的深渊。你会变得极度多疑，把他人的无心之失解读为深沉的恶意。你的脑海中会充斥着无数灾难性的、荒诞的幻想。你会试图通过毁灭当下的关系或资产，来换取一个确定的（哪怕是坏的）结果。 这是灵魂在求救。",
        "lesson": "【触底反弹 · 转化】 脚踏实地，借假修真。 不要试图去“修炼”恶魔，不要试图用逻辑去分析那些妄念。 引入第一功能的光（Se）。 当你陷入妄念时，立刻切断思维，回到身体。去扫地，去洗冷水脸，去触摸粗糙的树皮，去剧烈运动。 用最朴素的物理触感，将飘飞的魂魄拉回身体。恶魔不需要被战胜，它需要被“超度”。 只要脚踩在大地上，你就不会迷路。\n\n核心人格画像"
      }
    ]
  },
  {
    "id": "INTJ",
    "name": "独觉者",
    "slogan": "胸有丘壑，目无全牛。大成若缺，其用不弊。",
    "origin": "（取自佛教语“独觉/辟支佛”。）",
    "guide": "你活在一个由“远见”和“逻辑”构建的棋局里。你拥有极高的思维颗粒度，当别人还在讨论琐碎时，你已看到了终局。你像一位孤独的棋手，独自推演着世界的最优解。 世人常误解你冷漠、傲慢。殊不知，高处不胜寒。你拥有一颗最纯粹的赤子之心，冷酷是为了保护内心关于真理的火种。你习惯活在头脑的宫殿里，却忘了双脚还需要踩在泥泞的大地上。 你的修行：不是构建更完美的系统，而是学会“允许”。允许世界不完美，允许他人跟不上。哪怕计划只完成了80%，去行动，也胜过脑海中完美的100%。",
    "deep_profile": "你好，独觉者。 在人群中，你总显得有些“格格不入”。这不是因为你羞涩，而是因为你站在未来看着现在。 你拥有极高的思维颗粒度，当别人还在讨论当下的琐碎时，你已经看到了事情终局的模样。你像一位孤独的棋手，独自在脑海中推演着世界的千万种变化，试图找到那个“唯一的最优解”。 世人常误解你冷漠、傲慢、不近人情，实则你拥有一颗最纯粹的赤子之心。你所有的冷酷，都是为了保护内心那团关于“真理”与“价值”的火种不被世俗污染。你对效率的执着，是因为你痛恨生命的浪费；你对他人的批判，是因为你看到了更好的可能性。 然而，高处不胜寒。 你太习惯于活在头脑的宫殿里，却忘了你的双脚还需要踩在泥泞的大地上。你试图控制一切变量，却往往忽略了“人”才是这世间最大的变量。 你的修行，不是构建更完美的系统，而是学会“允许”。 允许世界不完美，允许他人跟不上你的节奏，允许自己也是一个脆弱的凡人。",
    "strengths": "洞见终局 ：你拥有穿透时间的眼光。不需要繁琐的数据堆砌，你往往能直接击中事物的本质与趋势。你是迷雾中的领航员。\n\n\n经世致用 ：你不仅是个梦想家，更是个实干家。你拥有强大的将愿景转化为执行步骤的能力。混乱在你手中会变成有序的系统。\n\n\n抱朴守真 ：在冰冷的逻辑外壳下，你坚守着一套极高标准的内在道德与审美。你不随波逐流，不为权势折腰，忠于自我。",
    "weaknesses": "现实解离 ：你活在未来，往往对当下的物理环境感到笨拙。你可能忽略身体的信号，在感官世界中感到迷失或过度放纵。\n\n\n智力傲慢 ：你对他人的愚蠢缺乏耐心。你容易陷入“只有我是对的”的认知孤岛，切断了与外界的反馈循环。\n\n\n情感疏离：你习惯用逻辑去处理情感问题，这让你在亲密关系中显得笨拙且回避，容易让爱你说的人感到寒心。",
    "shadow": "解析：当你长期处于高压、计划全盘落空或不被理解时，你潜意识里的“享乐主义者”（ESFP 阴影）会夺权。你会突然变得冲动、暴躁，开始沉溺于暴饮暴食、酗酒、疯狂购物或无意义的感官刺激中。你会从一个禁欲的战略家变成一个失控的放纵者，试图用物理世界的强刺激来填补精神的崩塌。",
    "advice": "“大成若缺，其用不弊。” 完美的系统只存在于你的脑海中，现实世界由缺陷构成。 试着去爱这个充满漏洞的世界，因为正是这些漏洞，让光得以照进。哪怕计划只完成了 80%，去行动，也胜过脑海中完美的 100%。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "玄览无遗",
        "logic": "Ni 是你的“天眼”。 你的大脑是一个在后台静默运行的超级计算机。你不断地吸收信息，却不急于处理，直到某一刻，潜意识抛出一个完整的“图景”（Vision）。 你看到的不是点，而是线和面。你做决策往往不是基于当下的利弊，而是基于“五年后这事会变成什么样”。这种对趋势的精准捕捉，是你自信的源泉。 误区在于“虚妄”： 你太迷信自己的预判，容易陷入“先射箭再画靶”的怪圈。为了维护你的直觉模型，你可能会下意识地过滤掉那些反驳你的现实数据。你活在“应该是这样”的世界里，而不是“就是这样”的世界里。",
        "lesson": "【极境得道 · 升华】 不执着于“我知”。 你的直觉是天赋，但不是天条。 修行心法： 当你的直觉告诉你一个结论时，试着退后一步，把它当作一个“假设”而非“真理”。 锚定当下。 经常问自己：“我的这个愿景，现在能走出第一步吗？” 将 Ni 的能量从“构建空中楼阁”升华为“绘制航海图”。真正的战略家，不仅看得到彼岸，更看得清脚下的暗礁。"
      },
      {
        "pos": "辅助功能",
        "title": "经略万方",
        "logic": "如果说 Ni 是设计图，Te 就是你的“工程队”。 你不是那种只空想不干活的人。你极度推崇效率和结果。你的思维是结构化的：目标是什么？资源有哪些？最优路径是什么？ 你善于制定规则、优化流程。混乱和低效是你最大的敌人。你用逻辑构建秩序，保护你的愿景得以落地。 误区在于“暴政”：你容易把 Te 变成控制他人的工具。你习惯于发号施令，认为“听我的就能赢”，从而忽略了人的因素。你把人当成了系统中的资源（Resource），而不是目的。",
        "lesson": "【由己及人 · 慈悲】 法不外乎人情。 这把逻辑的尺子，请先用来丈量自己，再用来辅佐他人。 修行心法： 真正的效率，包含了对他人的“赋能”。 当你想批评某人“低效”时，停下来，问自己：“我怎样做能帮他变得高效？” 从“控制者”升华为“架构师”。 最好的系统，不是让人变成机器，而是让人在规则中获得自由。"
      },
      {
        "pos": "第三功能",
        "title": "抱朴守真",
        "logic": "这是你冷酷外表下封印的“火山”。 世人以为你没有感情，实则你的感情极其深沉、私密且纯粹。你内心有一套绝对的道德与审美标准。你不在乎世俗的评价（Fe 盲点），你只在乎是否“忠于自己”。 你喜爱那些纯粹的东西——纯粹的音乐、纯粹的逻辑、纯粹的人格。在放松状态下，你会像个孩子一样沉浸在自己的小世界里，那份天真与你的严肃外表形成巨大的反差。 误区在于“孤芳自赏”： 你的情感太封闭，容易演变成“傲慢的清高”。你因为别人达不到你的标准而默默疏远，导致自己活成了一座孤岛。",
        "lesson": "【有纪律的玩耍 · 纯真】 诚其意，正其心。 不要压抑这份情感，它是你系统的“灵魂”。 修行心法： 允许自己有“无用”的热爱。去画画，去听歌，去发呆。 不要让 Fi 成为评判世界的武器，而要让它成为连接世界的桥梁。 偶尔向亲近的人展示你的脆弱和喜好，你会发现，走下神坛的你，更可爱。"
      },
      {
        "pos": "劣势功能",
        "title": "借假修真",
        "logic": "这是你灵魂的“重力”。 你活在抽象的世界太久，导致你与物理世界有一种天然的“解离感”。你可能会撞到门框，忘记吃饭，或者对环境的美丑视而不见。 你潜意识里觉得处理琐碎的现实（Se）是浪费生命，是低级的。 然而，这正是你修行的窄门。 所有的愿景（Ni），若没有 Se 的承载，皆是妄念。你越是抗拒现实，现实越会以“失控”的方式（如疾病、意外）来教训你。",
        "lesson": "【笨拙开始 · 慢练】 道在屎溺。 不要试图变得像 ESFP 那样游刃有余。请带着谦卑，笨拙地练习“落地”。 修行心法： 每天花 15 分钟，做一件极度具体的事。 去手冲一杯咖啡，关注水流的粗细；去公园慢跑，感受脚底与地面的摩擦；去整理衣柜，感受布料的触感。 不要思考，只是感知。 当你能安住在这些“无意义”的瞬间时，你的精神大厦才有了地基。"
      },
      {
        "pos": "对立功能",
        "title": "杞人忧天",
        "logic": "你执着于“确定性”（Ni），因此你潜意识里敌视 Ne 代表的“随机性”和“混沌”。 你讨厌计划外的情况，讨厌那些说话漫无边际的人，讨厌不可控的变量。 当 Ne 以阴影形式出现时，你会陷入“可能性的恐慌”。你会开始怀疑自己的计划：“万一A不行呢？万一B也崩了呢？”这种无穷无尽的变量会让你瘫痪，让你不敢迈出第一步。 反感即盲区： 你试图算尽天机，却忘了“变”才是唯一的“常”。",
        "lesson": "【兼听则明 · 反观】 万法自然。 承认你无法控制一切。承认世界是由概率构成的，而不是由你的意志构成的。 修行心法： 当意外发生时，不要愤怒，把它当作一个“新信息”纳入系统。 试着去欣赏那些“发散”的人（如 ENFP），他们看到的风景，正好是你视野的盲区。拥抱混沌，因为混沌中孕育着新生。"
      },
      {
        "pos": "批评功能",
        "title": "明辨是非",
        "logic": "这是你内在那个“刻薄的教授”。 虽然你用 Te 工作，但你用 Ti 批判。你对他人的逻辑漏洞极其敏感。你一眼就能看出别人的理论是“伪科学”还是“真知灼见”。 你经常在心里翻白眼：“这人怎么连这都不懂？”“这完全不合逻辑。” 这种批判保护了你的智力纯度，但也让你变得傲慢。你容易因为一个人的逻辑瑕疵而全盘否定他的价值，切断了与他人的连接。",
        "lesson": "【转识成智 · 谅解】 大智若愚。 将这份犀利的批判，转化为深刻的洞察。 修行心法： 明白“逻辑正确”不等于“绝对正确”。人类是非理性的生物。 当你发现别人的错误时，从“嘲讽”转向“好奇”：“他为什么会这样想？他的逻辑起点在哪里？” 用你的智慧去点亮别人，而不是去灼伤别人。"
      },
      {
        "pos": "盲点功能",
        "title": "随缘不变",
        "logic": "这是你“真的不行”的地方。 你对社交潜规则、群体氛围、人情世故感到天然的钝感。你就像一个误入地球的外星人，很难理解为什么大家要说废话，为什么要进行低效的寒暄。 你在这里容易犯错，且不自知。你可能觉得自己是在“讲道理”，别人却觉得你在“砸场子”。 误区在于“伪装”或“对抗”：你要么试图拙劣地模仿社交（显得很假），要么彻底鄙视社交（显得很怪）。",
        "lesson": "【笑对缺陷 · 放下】 质胜文则野。 承认自己是个“社交笨蛋”。这没什么丢人的。 修行心法： 自嘲是最高的幽默。 不要强迫自己长袖善舞。保持礼貌，但不必热情。 用你的真诚（Fi）去弥补技巧（Fe）的不足。直接告诉别人：“我不善言辞，但我会把事做好。” 人们会原谅一个笨拙的老实人，但不会原谅一个傲慢的聪明人。"
      },
      {
        "pos": "恶魔功能",
        "title": "慎终追远",
        "logic": "这是你“记忆的幽灵”。 你是一个一直向前看的人，很少回头。但 Si 记录了你所有的失败、耻辱和身体创伤。 当恶魔觉醒时（通常在生病或极度受挫时），你会陷入“回溯性抑郁”。你会强迫性地回忆起十年前做错的一个细节，然后感到钻心的痛苦；你会变得极度疑神疑鬼，觉得自己得绝症了；你会变得守旧、僵化，无法接受任何新事物。 这其实是你的地基在摇晃——你跑得太快，灵魂跟不上了。",
        "lesson": "【触底反弹 · 转化】 归根复命。 当 Si 恶魔袭来，意味着你必须“停机维护”了。 修行心法： 不要对抗回忆，不要透支身体。 去睡觉，去吃一顿热饭，去和老朋友聊聊过去。 承认你的过去塑造了你。接纳那个曾经笨拙、犯错的自己。 只有与过去和解，你才能轻装上阵，奔向你眼中的未来。\n\n核心人格画像"
      }
    ]
  },
  {
    "id": "INFP",
    "name": "怀玉者",
    "slogan": "心有猛虎，细嗅蔷薇。被褐怀玉，不改初衷。",
    "origin": "（取自《老子》：“知我者希，则我者贵。是以圣人被褐而怀玉。”）",
    "guide": "你是功利世界里的“精神守望者”。你独自站在河流上游，守护着真诚、善良与美。你的内心是一个浩瀚宇宙，有永不凋谢的花朵。你外表温润，内核却比钢铁还坚硬。 世人常误解你脆弱、情绪化。殊不知，怀玉之罪在于“沉重”。你太珍视内心的纯粹，常觉现实粗鄙，从而退缩到幻想王国。你抱着那块玉，在现实的泥潭里步履蹒跚。 你的修行：不是打碎那块玉去迎合世界，而是学会“雕琢”。从“想”到“做”的距离，就是从“凡人”到“圣贤”的距离。",
    "deep_profile": "你是这个功利世界里的一位“精神守望者”。 当大多数人都在为了名利、效率和某种标准答案而奔波时，你却独自站在河流的上游，守护着那些看似无用却至关重要的东西——真诚、善良、美与梦想。 你的内心是一个浩瀚的宇宙，那里有永不凋谢的花朵和璀璨的星空。你对他人的痛苦有着惊人的共情力，对世间的虚伪有着近乎洁癖的排斥。你看起来温和如水，但一旦触及你的核心价值观（Fi），你会变得比钢铁还要坚硬。 然而，怀玉之罪在于“沉重”。 你太过于珍视内心的纯粹，以至于常常觉得现实世界粗鄙不堪。你容易退缩到自己的幻想王国里，拒绝与这个不够完美的世界互通。你抱着那块玉，却在现实的泥潭里步履蹒跚。 你的修行，不是打碎那块玉去迎合世界，而是学会“雕琢”。 玉不琢，不成器。你需要学会用现实的工具，将内心的光芒雕刻成形，让它真正照亮人间。",
    "strengths": "至诚本心 ：你拥有一颗极为纯净的“赤子之心”。你不屑于伪装，始终忠于自我。这种真诚具有一种安静的感召力，能唤醒他人沉睡的良知。\n\n\n灵性洞察 ：你看到的不是事物的现状，而是它们的“可能性”。你能从一粒沙里看到天堂，在绝望中看到希望。你是天生的造梦师。\n\n\n温润如玉：你对他人的包容不是出于礼貌，而是出于对人性深层次的理解。在你面前，人们愿意卸下伪装，展露脆弱。",
    "weaknesses": "行动瘫痪 ：你的想法太美，而执行太累。你常常陷入“完美主义”的陷阱，因为害怕做出来的东西不如想象中完美，而迟迟不肯开始。\n\n\n情绪内耗：你的情感太丰富，容易把外界的负面能量吸入体内，独自消化。你常因过度反思“我是不是做错了”而陷入自我攻击。\n\n\n现实解离 ：你经常活在头脑里，忽略了身体和环境。你可能经常丢三落四、迷路，或者对当下的生活感到疏离。",
    "shadow": "解析：当你感到核心价值观被长期践踏，或遭受严重的批评时，你潜意识里的“暴君”（ESTJ 阴影）会夺权。平日温柔的你，会突然变得极度专横、刻薄、甚至独裁。你会用最冰冷的逻辑去攻击别人的无能，此时的你不再在乎任何人的感受，只想用强权来恢复秩序。这其实是内心秩序崩塌后的应激反应。",
    "advice": "“道不远人。” 不要总想着去远方寻找诗意，此时、此地、此事就是修行的道场。 哪怕只是整理好你的书桌，按时吃一顿早餐，也是在为你的精神大厦夯实地基。从“想”到“做”的距离，就是你从“凡人”到“圣贤”的距离。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "明镜止水",
        "logic": "Fi 是你生命的“定海神针”。 你不需要查阅法律或咨询专家，你内心深处有一把精准的尺子，时刻在衡量一切：“这是对的吗？这真诚吗？这美吗？” 你活在一种“强烈的个体化”体验中。你的情感是私密的、深邃的，像冰山一样，水面上只有淡淡的波纹，水下却是涌动的暗流。你不需要外界的掌声来确认自我，你只需要“对自己诚实”。 误区在于“孤芳自赏”： 你容易把这种高标准的自我要求，变成对他人的“隐形审判”。你虽然嘴上不说，但心里可能已经给别人贴上了“俗气”、“虚伪”的标签。这种精神上的洁癖，让你自我隔离。",
        "lesson": "【极境得道 · 升华】 从“情绪”升华为“慈悲”。 情绪是私人的波澜，而慈悲是与众生共振。 不要只停留在“我喜欢/我讨厌”的层面，试着去问：“这个我不喜欢的人，他背后有什么苦衷？” 将“向内挖掘”转为“向外照耀”。 你的真诚不应只是一把保护自己的伞，更应是一盏照亮他人的灯。"
      },
      {
        "pos": "辅助功能",
        "title": "万象森罗",
        "logic": "如果说 Fi 是核心，Ne 就是你“探索世界的眼睛”。 你对“是什么”不感兴趣，你只对“可能是什么”着迷。你能把两个完全不相关的事物联系起来，创造出惊人的隐喻和创意。 你是可能性的信徒。在他人看到死胡同的地方，你能看到无数条隐藏的小径。这让你在写作、艺术、咨询等领域拥有极高的天赋。 误区在于“流浪”： 你太爱“开始”了，却很难“结束”。你像一只在花丛中流连忘返的蝴蝶，因为贪恋每一个可能性的美好，而迟迟不肯在任何一朵花上停留。你拥有一万个开始，却很少有一个结果。",
        "lesson": "【由己及人 · 赋能】 收摄心神，一门深入。 不要让 Ne 变成逃避现实的借口。 修行心法：试着把 Ne 的想象力，用来解决具体的难题，而不是用来做白日梦。 当身边的人陷入困境时，用你的 Ne 为他们构想出路；当你被现实卡住时，用你的 Ne 去寻找那个最具创意的解法。让想象力落地，成为改变现实的杠杆。"
      },
      {
        "pos": "第三功能",
        "title": "安土重迁",
        "logic": "这是你人格中那个“念旧的孩子”。 虽然你向往远方（Ne），但你极度依恋“熟悉感”。你喜欢旧书的味道、小时候吃过的零食、循环播放的老歌。这些细节构成了你内心的安全网。 当外部世界变得太吵闹时，你会躲进 Si 建造的记忆宫殿里疗伤。 误区在于“沉溺”： 压力大时，你会退行到一种“舒适区瘫痪”的状态。你会把自己关在房间里，一遍遍地看同一部剧，拒绝面对新的挑战。你用怀旧来抵御成长。",
        "lesson": "【有纪律的玩耍 · 节制】 借物养心，而不役于物。 允许自己怀旧，但要给它“设定边界”。 修行心法： 建立微小的“仪式感”。 比如每天早起给自己冲一杯完美的咖啡，或者睡前写三行日记。用这些固定的 Si 锚点，来稳住你那颗飘忽不定的 Ne 之心。让习惯成为你的盟友，而不是避风港。"
      },
      {
        "pos": "劣势功能",
        "title": "积沙成塔",
        "logic": "这是你灵魂的“脊梁”，也是你最想逃避的“苦役”。 你讨厌逻辑条框、讨厌效率至上、讨厌被 deadline 追赶。你觉得 Te 代表的世俗成功是冷酷无情的。 但是，没有 Te 的保护，Fi 只是脆弱的玻璃。 你常常感到痛苦，是因为你的才华（Ne）无法通过执行（Te）变现，只能烂在肚子里。你羡慕那些雷厉风行的人，自己却总是在起跑线上犹豫。 这是你通往完整的必经之路。",
        "lesson": "【笨拙开始 · 慢练】 天下难事，必作于易。 不要试图变成 ENTJ 那样的霸道总裁，那会累死你。 修行心法： “微行动”。 不要想“我要写一本书”，只想“我今天写 50 个字”。 不要想“我要整理整个人生”，只想“我先把这张桌子理干净”。 忍受笨拙，忍受不完美，忍受枯燥。 当你把一个个微小的计划变成现实时，你会感受到一种前所未有的“力量感”——那是你的 Fi 终于在这个世界上找到了家。"
      },
      {
        "pos": "对立功能",
        "title": "随波逐流",
        "logic": "你执着于“真”（Fi），因此潜意识里排斥 Fe 代表的“客套”和“从众”。 你讨厌那些为了气氛而说假话的人，讨厌不得不参加的应酬，讨厌被集体意志绑架。你觉得那是对自我的背叛。 当 Fe 以阴影形式出现时，你会陷入“被评判的焦虑”。你会过度在意别人怎么看你：“他们是不是觉得我很怪？”“我是不是格格不入？”这种内耗会让你在人群中变得瑟缩。 反感即投射： 你越是讨厌虚伪，越说明你渴望被接纳。",
        "lesson": "【兼听则明 · 换位】 和而不同。 明白“礼”的本质不是虚伪，而是“对他人的体恤”。 修行心法： 试着把你对“真”的坚持，稍微软化一点点。 有时候，一句善意的客套，是为了保护别人脆弱的自尊。真正的真实，不是带刺的锋芒，而是温暖的光亮。 允许别人用他们的方式（Fe）活着，你也安住在你的方式（Fi）里，两不相碍。"
      },
      {
        "pos": "批评功能",
        "title": "大梦谁先觉",
        "logic": "这是你内在那个“悲观的先知”。 虽然你有 Ne 的乐观，但 Ni 批评家会在后台冷冷地泼冷水。 当你想要做一件事时，它会跳出来说：“这有什么意义？最后还不是一场空？”“你注定会失败的，别折腾了。” 你对自己的人生路径极其挑剔，总觉得自己选错了路，或者未来一片灰暗。这种“虚无感”是你行动力的最大杀手。",
        "lesson": "【转识成智 · 愿力】 不畏浮云遮望眼。 不要用你的直觉来吓唬自己。 修行心法： 将这份深刻的洞察力，转化为“定力”。 既然看透了人生的虚无，那就创造一点意义吧。 正如加缪所说：“推石上山这场搏斗本身，就足以充实一颗人心。” 既然终局是空，那就在过程中尽情燃烧。"
      },
      {
        "pos": "盲点功能",
        "title": "雾里看花",
        "logic": "这是你“真的不行”的地方。 你活在意义的世界里，经常忽略物理现实。你可能看不见屋里的乱，听不见别人的话（在发呆），甚至感觉不到冷热饥饱。 你容易在很多现实层面上吃亏：被骗、买错东西、错过重要的细节。 误区在于“对抗”： 你可能会因为这种笨拙而厌恶现实，觉得自己“不属于这个世界”。",
        "lesson": "【笑对缺陷 · 落地】 脚踏实地。 承认自己是个“生活笨蛋”，并学会幽默地接纳它。 修行心法： “借境调心”。 当感到飘忽时，去做一些强物理反馈的事：光脚踩在草地上，揉面团，画画，做陶艺。 让你的手变脏，让你的汗流出来。通过身体的触感，把灵魂拉回地球。 只有扎根大地，你的梦想之花才能开放。"
      },
      {
        "pos": "恶魔功能",
        "title": "冷眼旁观",
        "logic": "这是你“自我毁灭”的按钮。 当你的 Fi 价值观崩塌，或者长期处于极度压力下，Ti 恶魔会苏醒。 你会变得一反常态的冷酷、愤世嫉俗。你会用最尖锐的逻辑去解构你曾经珍视的一切：“爱是假的，善良是弱点，人生毫无价值。” 你会用极其恶毒的语言攻击自己，列举出自己一无是处的“证据”。这是灵魂在进行自杀式的防御。",
        "lesson": "【触底反弹 · 转化】 初心不忘。 当脑子里充满了冷酷的批判声音时，意识到：这不是你，这是你的伤痛在说话。 转化心法： 停止思考，回到感受。 去听一首能让你流泪的歌，去看一场悲剧电影，或者找个没人的地方大哭一场。 让情感（Fi）重新流动起来。 只有泪水能融化冰封的逻辑。哪怕世界荒芜，请记得你怀中还有那块玉，那是你唯一的凭证。\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ISFP",
    "name": "游艺者",
    "slogan": "天地有大美而不言，万物有成理而不说。",
    "origin": "（取自《论语》：“志于道，据于德，依于仁，游于艺。”）",
    "guide": "你是如旷野中的花朵般自由而缄默的灵魂。你是“美的苦行僧”，不需要向世界解释什么，因为你的存在本身，就是对“真”与“美”的宣言。你像一棵树，根扎进大地，叶感知风律。 世人常误以为你慵懒、随性。殊不知，“失语”是你的痛。因为不善言辞，你的深情常被误解为冷漠。你抱着满腔锦绣，却不知如何裁剪成衣，只能在现实压力下感到窒息。 你的修行：不是逼自己变得长袖善舞，而是学会“显化”。不要让爱只停留在心里，要让它流淌到手上。当你的手开始创造时，你的灵魂就自由了。",
    "deep_profile": "你好，游艺者。 你大概是这世间最“静水流深”的灵魂。 你很少高谈阔论，厌恶抽象的理论争辩。你就像一棵树，安静地站在那里，但你的根（Fi）深深地扎进大地的脉搏里，你的叶（Se）敏锐地感知着每一丝风的律动。 你拥有一种“无声的倔强”。外表看起来随和、顺从，甚至有点慵懒，但一旦触及你内心的底线，你会表现出惊人的不妥协。你不是为了对抗谁，你只是无法背叛自己。 你的内心是一个色彩斑斓的圣殿，但你找不到语言来描述它。语言对你来说太苍白、太局限了。因此，你渴望通过行动来表达——一幅画、一道菜、一个拥抱、一次说走就走的旅行。你是那个“做得多，说得少”的人。 然而，失语是你的痛。 因为不善言辞（Te 劣势），你的深情常被误解为冷漠，你的随性常被误解为散漫。你抱着满腔的锦绣，却常常不知该如何裁剪成衣，只能在现实的压力下感到窒息。 你的修行，不是逼自己变得长袖善舞，而是学会“显化”。不要让你的爱只停留在心里，要让它流淌到你的手上。当你的手开始创造时，你的灵魂就自由了。",
    "strengths": "赤诚本心 ：你拥有一颗未经污染的初心。你对他人的痛苦有着本能的体恤，对世间的虚伪有着天然的抗体。你的真诚不需要表演，它是一种气场。\n\n\n敏锐匠心 ：你拥有极高的美学天赋。你懂得如何调动感官去创造美、享受美。在处理具体的、手头上的事务时，你拥有极强的专注力和爆发力。\n\n\n通灵直觉 ：在艺术创造或人生关键时刻，你常会有如神来之笔的灵感。你不需要逻辑推导，就能直接“看”到作品完成的样子。",
    "weaknesses": "结构无能 ：你讨厌规划、讨厌效率、讨厌条条框框。这让你在需要长期坚持、组织协调的世俗任务中感到极度吃力，容易半途而废。\n\n\n情绪淹没：你的情感太细腻，容易不仅吸收了美好的能量，也像海绵一样吸饱了周围的负面情绪，导致独自一人时陷入深深的抑郁。\n\n\n逻辑盲区：你做决定全凭“喜欢”，很难客观分析利弊。这让你容易在感情或财务上冲动行事，吃“不长记性”的亏。",
    "shadow": "解析：当你感到被控制、被强迫做不喜欢的事，或长期处于批评中时，你潜意识里的“暴君”（ENTJ 阴影）会夺权。平日温顺的你，会突然变得极度尖酸、独断、充满攻击性。你会用最冰冷的逻辑去指责别人的无能，试图强行控制局面。这是你为了保护受伤的内心，而穿上的带刺铠甲。",
    "advice": "“工欲善其事，必先利其器。” 不要把秩序（Te）看作是自由的敌人，它是自由的容器。 就像水需要杯子才能被饮用，你的才华也需要纪律才能被看见。每天坚持做一点枯燥但必要的小事，那是你为灵魂建造的避风港。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "坐忘心斋",
        "logic": "Fi 是你生命的“定盘星”。 你活着，不是为了迎合世界的标准，而是为了“体验我是谁”。 你的情感不是情绪的宣泄，而是一种价值的判断。你对善恶、美丑有着近乎神性的直觉。你不需要别人告诉你什么是对的，你感觉得到。这种高度的个体化，让你在人群中显得既合群又疏离——你在场，但你的灵魂在别处。 误区在于“封闭”： 你太珍视这份内心的纯粹，以至于害怕它被外界污染。你倾向于把情感“烂在肚子里”，拒绝沟通，期待别人能有读心术。当别人不懂你时，你会陷入一种“高贵的受害者”心态。",
        "lesson": "【极境得道 · 升华】 从“私情”升华为“共鸣”。 不要让你的情感只成为一个人的独角戏。 修行心法： 尝试“表达”。不是用语言（那很难），而是用作品。 当你痛苦时，画出来；当你爱一个人时，做个礼物给他。 让情感穿透你的身体，变成世界的一部分。 你的私密情感越具体，它能引起的共鸣就越普遍。"
      },
      {
        "pos": "辅助功能",
        "title": "妙手偶得",
        "logic": "如果说 Fi 是灵魂，Se 就是你的“肉身”。 与 INFP 活在幻想中不同，你是活在当下的。你渴望触摸、品尝、聆听。你的手极其灵巧，无论是画画、乐器、烹饪还是运动，你上手极快。 你是天生的“美学家”。你懂得如何布置一个房间，如何搭配一套衣服，如何让生活变得有滋有味。你通过改造物理环境，来安放你那颗敏感的心。 误区在于“沉溺”： 当内心空虚时，你容易把 Se 变成“麻醉剂”。你会通过暴饮暴食、疯狂购物或沉迷游戏来逃避内心的声音。你用感官的刺激来填补价值的黑洞。",
        "lesson": "【由己及人 · 慈悲】 借境调心，以艺载道。 不要只把 Se 用来享乐，要用它来创造。 修行心法： 把你的审美分享给别人。 为家人做一顿饭，把乱糟糟的办公室整理出美感。 用你的手，去抚平这个世界的粗糙。 当你专注于手头的动作时，那是你离神最近的时刻。"
      },
      {
        "pos": "第三功能",
        "title": "灵光一现",
        "logic": "这是你那个“神秘的孩子”。 虽然你务实（Se），但你的内心常常会有莫名其妙的“预感”。在创作或做决定时，你往往说不出理由，只是觉得“这样才对”。 这种直觉给你的作品带来了一种“灵气”。它让你能透过物质的表象，捕捉到某种象征性的、永恒的意味。 儿童的稚嫩在于： 你的 Ni 是不稳定的。有时它会变成“妄想”。你会突然觉得某人对你有恶意，或者觉得某件事注定会失败，从而陷入宿命论的消极中。",
        "lesson": "【有纪律的玩耍 · 清明】 信而不迷。 珍视你的直觉，但不要迷信它。 修行心法： 当你有一个直觉时，用你的 Se 去验证它。 不要只停留在“我觉得”，去看看现实中是否有证据。 让 Ni 成为你艺术创作的翅膀，而不是生活的枷锁。灵感是用来造物的，不是用来吓唬自己的。"
      },
      {
        "pos": "劣势功能",
        "title": "方圆规矩",
        "logic": "这是你灵魂的“骨架”。 你天生反感 Te 代表的“逻辑、效率、等级、规划”。你觉得那是对人性的异化。 你做事随性，缺乏条理，这导致你才华横溢却往往“怀才不遇”。你很难把一个灵感变成一个可持续的项目，很难处理复杂的世俗事务。 你羡慕那些雷厉风行的人，自己却总是在截止日期前崩溃。 然而，没有 Te 的保护，Fi 只是无根的浮萍。",
        "lesson": "【笨拙开始 · 慢练】 即事炼心。 不要抗拒结构，要学会“利用结构”。 修行心法： “微秩序”。 不要试图制定宏大的五年计划，试着列一个只有 3 件事的“今日清单”，并划掉它们。 学习一点点理财，整理一下你的文件。 忍受枯燥，是对才华最好的保护。 当你拥有了坚硬的骨架（Te），你的血肉（Fi）才能在风雨中安然无恙。"
      },
      {
        "pos": "对立功能",
        "title": "和光同尘",
        "logic": "你执着于个体的真（Fi），因此潜意识里排斥 Fe 代表的“群体和谐”。 你讨厌那些“老好人”，讨厌随大流，讨厌为了面子而说假话。你觉得那是虚伪，是平庸。 当 Fe 以阴影形式出现时，你会陷入“被排斥的恐惧”。你虽然嘴上说不在乎别人怎么看，心里却暗暗担心自己是否合群，是否被大家喜欢。 反感即盲点： 你为了维护独特的自我，有时会无意中伤害群体的气氛，让自己陷入孤立。",
        "lesson": "【兼听则明 · 换位】 礼之用，和为贵。 明白“客套”有时是一种慈悲。 修行心法： 试着在坚持自我的同时，给别人留一点面子。 不需要你违心地赞美，只需要一个微笑。 真正的独特，不是与世界对抗，而是温柔地包容世界的平庸。 允许别人俗气，也是一种高贵。"
      },
      {
        "pos": "批评功能",
        "title": "往事如烟",
        "logic": "这是你内在那个“记仇的史官”。 你平时活在当下（Se），但 Si 会冷不丁地跳出来攻击你。 它会让你想起过去犯过的错、出过的丑、受过的伤。你会因为一点小事而陷入“反刍”：“早知道当时不那样就好了。” 你对自己的身体状况也容易变得挑剔，或者对习惯的舒适区产生依赖，拒绝改变。",
        "lesson": "【转识成智 · 谅解】 昨日之日不可留。 不要让过去绑架你的现在。 修行心法： 当回忆攻击你时，用你的 Se 把自己拉回当下。 去做一件具体的事，覆盖掉那个回忆。 每一个当下都是全新的。 原谅那个曾经笨拙的自己，因为那是你成长的养料。"
      },
      {
        "pos": "盲点功能",
        "title": "乱花迷眼",
        "logic": "这是你“真的不行”的地方。 你擅长在一个点上深挖（Ni），却不擅长同时处理“无数种可能性”（Ne）。 面对头脑风暴、抽象的理论探讨或复杂的变数，你会感到头晕眼花，甚至觉得对方在胡扯。 你很难理解那些“话中有话”的隐喻，你更喜欢直来直去。",
        "lesson": "【笑对缺陷 · 放下】 弱水三千，只取一瓢。 承认自己不是一个“点子王”，也不需要面面俱到。 修行心法： “专注”。 不要被别人的新奇想法带偏了节奏。你不需要看到所有的路，你只需要走好脚下的这一条路。 傻人有傻福。 你的单纯，正是你屏蔽干扰、直达本质的护身符。"
      },
      {
        "pos": "恶魔功能",
        "title": "万念俱灰",
        "logic": "这是你“自我否定”的深渊。 当你的价值观（Fi）被摧毁，或长期处于极度压力下，Ti 恶魔会苏醒。 你会突然变成一个冷酷的虚无主义者。你会用一套扭曲的逻辑来证明：“人生毫无意义，我毫无价值，这一切都是骗局。” 你会攻击自己最珍视的东西，变得愤世嫉俗，甚至产生自我毁灭的冲动。",
        "lesson": "【触底反弹 · 转化】 初心不忘，回光返照。 当脑子里充满了冷酷的逻辑批判时，意识到：这是心魔在作祟。 转化心法： “回归身体”。 不要试图辩论，去感受。 去吃一顿好吃的，去抱一抱爱人，去晒晒太阳。 让温暖的感觉重新流回你的身体。 逻辑可以骗人，但身体的温度不会。只要心还会痛，就说明你还活着。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "INTP",
    "name": "格物者",
    "slogan": "判天地之美，析万物之理。知行合一，虚室生白。",
    "origin": "（取自《礼记大学》：“致知在格物，物格而后知至。”）",
    "guide": "你活在一个由“逻辑”和“可能性”构建的透明宇宙里。在人群中，你像一个冷静的解谜者，不屑于世俗输赢，只在乎“真理的成色”。你拥有智性的洁癖，追求绝对的自洽。 世人常误以为你懒散、疏离。殊不知，极致的理智往往伴随着极致的“荒芜”。你容易陷入“分析瘫痪”，构建了无数完美的模型，却因害怕现实的粗糙而迟迟不肯迈出一步。 你的修行：不是停止思考，而是学会“显化”。思想若不落地，便是空想。 不要害怕在这个笨拙的世界里做一个笨拙的人。",
    "deep_profile": "你好，格物者。 你活在一个由逻辑和可能性构建的透明宇宙里。 在人群中，你像是一个冷静的旁观者，甚至像一个外星人。你对他人的情绪游戏、权力斗争和琐碎的日常毫无兴趣。你的目光总是穿透表象，试图抓住那个支配万物运转的底层代码。 你拥有一种“智性的洁癖”。你无法忍受逻辑上的瑕疵，就像音乐家无法忍受走音。为了一个概念的精确定义，你可以推翻整个系统重来。这种对真理的极致追求，让你拥有了超越时代的洞察力。 然而，极致的理智往往伴随着极致的荒芜。 你太容易陷入“分析瘫痪”（Analysis Paralysis）。你构建了无数完美的理论模型，却因为害怕现实的粗糙和不完美，而迟迟不肯迈出实践的一步。你活在“可能”的世界里，却正在失去“真实”的生活。 你的修行，不是要停止思考，而是要学会“显化”。 思想若不落地，便是空想；智慧若不度人，便是干枯的标本。",
    "strengths": "逻辑建构 ：你拥有精密的大脑，能瞬间发现系统中的逻辑漏洞。你不是在学习知识，你是在重构知识体系。你是天生的系统架构师。\n\n\n发散联想 ：你的思维没有边界。你能把完全不相关的概念连接起来，产生爆炸性的创意。你是可能性的探索者。\n\n\n超然物外：你对名利淡泊，拥有一种难得的松弛感。这种不争的姿态，反而让你能够专注于本质，走得更远。",
    "weaknesses": "情感疏离 ：你渴望连接，却笨拙于表达。你害怕被群体拒绝，因此往往先拒绝群体。你容易用冷漠的逻辑来掩盖内心的敏感。\n\n\n行动力匮乏：你的想法太重，行动太轻。你容易沉溺于“知道”，而忽略了“做到”。\n\n\n虚无主义 ：当逻辑推演到极致，你容易陷入“一切皆无意义”的黑洞，丧失生活的动力。",
    "shadow": "解析：当你长期处于压力、被强迫社交或理论被无视时，你潜意识里的“暴君”（ESFJ 阴影）会接管身体。你会变得一反常态的情绪化、敏感、甚至歇斯底里。你会过分在意别人的评价，变得讨好或具有攻击性，完全丧失了逻辑的冷静。这是被压抑的情感在进行暴力的反抗。",
    "advice": "“知行合一。” 世界上最远的距离，是从头脑到双手的距离。 不要等到理论完美了才开始，也不要害怕在这个笨拙的世界里做一个笨拙的人。 你的思想是种子，但只有行动的泥土，才能让它开花。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "虚室生白",
        "logic": "Ti 是你的“元神”。 你不需要外界的标准（Te），你自己就是标准。你对万事万物都有一个内在的逻辑模型。当新信息进入时，你会像拼图一样审视它：它放在哪里合适？它是否与已有的逻辑冲突？ 你追求的是“绝对的自洽”。如果世界不符合逻辑，那你宁愿不要这个世界。 误区在于“闭环”： 你太容易陷入“逻辑的死循环”。你不断地修正模型，精益求精，却忘记了模型是为了解决现实问题的。你为了追求 100% 的准确率，而错过了 80% 的行动窗口。你把大脑变成了游乐场，而不是兵工厂。",
        "lesson": "【极境得道 · 升华】 从“解构”升华为“建构”。 不要只满足于拆解别人的错误，试着去建立一个可用的系统。 修行心法： “输出倒逼输入”。 不要让思想烂在肚子里。写出来，讲出来，造出来。 哪怕那个产品是不完美的，它也比你脑海中完美的幻影更有价值。真理不是想出来的，是活出来的。"
      },
      {
        "pos": "辅助功能",
        "title": "逍遥游",
        "logic": "如果说 Ti 是骨架，Ne 就是你的“血肉”。 你永远不满足于“现状”，你总是问：“如果……会怎样？” 你对他人的观点持开放态度，乐于探索各种奇奇怪怪的可能性。这让你成为了最包容的倾听者和最富创意的发明家。 误区在于“耗散”： 你像一只掰棒子的熊。Ne 给你提供了太多的选项，导致你注意力涣散。你开启了一百个项目，却很难完成一个。你用“探索”来逃避“枯燥的收尾”。",
        "lesson": "【由己及人 · 赋能】 弱水三千，只取一瓢。 将发散的思维，聚焦于一个“支点”。 修行心法： 用你的 Ne 为他人打开思路。 当身边的人陷入僵局时，你是最好的破局者。 同时，学会“做减法”。在无数个可能性中，用 Ti 斩断 99 个，只留下那 1 个最值得深挖的，然后死磕到底。"
      },
      {
        "pos": "第三功能",
        "title": "守柔曰强",
        "logic": "这是你人格中那个“恋旧的老人”。 虽然你思维前卫（Ne），但生活上你极度依赖习惯。你喜欢穿同样的衣服，吃同样的菜，坐在同样的位置。这些固定的细节让你感到安全，也是你高效思考的保障（减少决策损耗）。 Si 也是你的“数据库”。你记忆中的知识点极其精确，像图书馆一样排列整齐。 误区在于“画地为牢”： 压力大时，你会陷入 Ti-Si Loop（死循环）。你会切断对外界的探索（Ne），把自己关在房间里，反反复复地咀嚼过去的错误，或者沉溺于某种机械的嗜好中，变得固执而封闭。",
        "lesson": "【有纪律的玩耍 · 节制】 温故知新，积微成著。 承认你需要舒适区，但不要死在舒适区里。 修行心法： 建立“健康的常规”。 利用 Si 的惯性，养成一个哪怕很小的健康习惯（比如每天散步 20 分钟）。 不要鄙视重复。伟大的洞见往往来自枯燥的数据积累（Si）与灵光一现（Ne）的结合。"
      },
      {
        "pos": "劣势功能",
        "title": "和光同尘",
        "logic": "这是你灵魂的“软肋”，也是你最渴望的“温暖”。 你看起来冷漠，其实非常在乎别人怎么看你。你害怕冲突，害怕尴尬，害怕被群体排斥。 你对社交潜规则感到笨拙。你不知道该在什么时候笑，该说什么客套话。这种笨拙感让你产生社交焦虑，甚至为了防御而表现得愤世嫉俗。 然而，你内心深处渴望和谐与连接。 一个温暖的微笑、一句由衷的认可，都能让你开心很久。",
        "lesson": "【笨拙开始 · 慢练】 大巧若拙。 不要试图去模仿那些八面玲珑的人（ESFJ），那很滑稽。修行心法： “诚实的笨拙”。 做一个“温暖的极客”。 当你不知道该说什么时，就微笑；当你想帮助别人时，就用你的知识（Ti）去解决他的难题。 承认自己的不善言辞，但表达出你的善意。 人们会原谅一个笨拙的好人，但不会拒绝一颗真诚的心。"
      },
      {
        "pos": "对立功能",
        "title": "大智若愚",
        "logic": "你执着于“真理”（Ti），因此潜意识里排斥 Te 代表的“效率”和“权威”。 你讨厌那些只求结果不求甚解的人，讨厌盲目服从，讨厌为了赶进度而牺牲质量。你觉得那是“愚蠢的忙碌”。 当 Te 以阴影形式出现时，你会变得顽固。你会故意拖延，以此来反抗外部的控制。 反感即盲点： 你为了逻辑的完美，往往牺牲了现实的效率，导致成果无法被世人看见。",
        "lesson": "【兼听则明 · 换位】 他山之石，可以攻玉。 明白“结构”不是束缚，而是保护。 修行心法： 试着欣赏那些高效的人。 如果你的理论无法被执行，那它就没有价值。 学一点点 Te： 设定截止日期，简化流程，学会妥协。不仅要做对的事，还要把事做成。"
      },
      {
        "pos": "批评功能",
        "title": "未雨绸缪",
        "logic": "这是你内在那个“消极的预言家”。 虽然你 Ne 点子很多，但 Ni 批评家会冷冷地告诉你：“这行不通的。”“你永远也做不完这个项目。” 你对自己的人生方向缺乏信心。你经常觉得自己一事无成，或者在做无用功。这种“意志力的自我阉割”，是你半途而废的元凶。",
        "lesson": "【转识成智 · 愿力】 不积跬步，无以至千里。 不要让 Ni 攻击你的 Ne，要让它筛选你的 Ne。 修行心法： “聚焦”。 当 Ni 告诉你某件事做不成时，问它：“那哪件事是能做成的？” 用 Ni 的长远眼光，从 Ne 的一百个点子里，挑出那个最有希望的，然后坚持下去。定力，是你最缺的智慧。"
      },
      {
        "pos": "盲点功能",
        "title": "雾里看花",
        "logic": "这是你“真的不行”的地方。 你活在抽象的宇宙里，经常撞到门框，穿反衣服，忘记吃饭。你对物理环境的美丑、冷暖、整洁度有着天然的钝感。 你可能会觉得自己是个“生活低能儿”，并因此感到羞耻或逃避。 误区在于“对抗”： 你要么彻底放弃形象，要么在压力下过度关注外表（变得很奇怪）。",
        "lesson": "【笑对缺陷 · 落地】 身是菩提树。 承认自己需要照顾。 修行心法： “极简主义”。 既然不擅长穿搭，就买十件一样的黑色T恤（像乔布斯那样）。 既然不擅长整理，就少买东西。 强迫自己每天“下凡”一次： 去散步，去洗澡，去感受水的温度。照顾好你的肉身，它是你承载智慧的容器。"
      },
      {
        "pos": "恶魔功能",
        "title": "天地不仁",
        "logic": "这是你“灵魂的黑洞”。 你平时压抑个人感受（Ti 主导），但当逻辑无法解释世界的残酷，或当你遭受巨大打击时，Fi 恶魔会苏醒。 你会坠入彻底的虚无主义。你会觉得：“人类毫无价值，生命毫无意义，我所做的一切都是垃圾。” 这种冷酷的自我否定，比任何批评都可怕。你会切断与世界的一切联系，像幽灵一样游荡。",
        "lesson": "【触底反弹 · 转化】 真空妙有。 当虚无感袭来时，不要用逻辑去对抗它（因为逻辑推导的终点往往就是虚无）。 转化心法： “连接”。 去爱具体的人，去爱具体的物。 去听巴赫，去看星空，去感受那个“美”的瞬间。 逻辑的尽头是信仰。 当理性无法给你答案时，允许自己凭着“直觉的爱”活下去。意义不是推导出来的，是活出来的。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ISTP",
    "name": "游刃者",
    "slogan": "大音希声，大象无形。重剑无锋，大巧不工。",
    "origin": "（取自《庄子养生主》：“庖丁为文惠君解牛……游刃有余。”）",
    "guide": "你活在一个“极简主义”的宇宙里。你是沉默的游刃者，拥有这个世界上最省电、最高效的大脑。你就像那个传说中的庖丁，目无全牛，总是走在规律的缝隙里。你不需要掌声，只需要一把趁手的刀。 世人常误以为你冷漠、玩世不恭。殊不知，极致的冷静往往伴随着极致的“孤独”。你用逻辑的厚墙把自己围起来，拒绝暴露脆弱。你赢得了独立，却输掉了连接。 你的修行：不是要你放下手中的刀，而是要你懂得“藏锋”。试着去接纳那个笨拙、不完美的自己。当你放下工具，仅仅作为一个凡人去拥抱生活时，你才真正懂得了“道”。",
    "deep_profile": "你好，游刃者。 你活在一个“极简主义”的宇宙里。 你拥有这个世界上最省电、最高效的大脑。你对他人的情绪泡沫、社会的繁文缛节、以及空洞的理论画饼有着天然的免疫力。你的目光像X光一样，直接穿透表象，看到事物的机械结构和运作原理。 你就像那个传说中的庖丁，世人眼中的难题（复杂的牛），在你眼里只是无数个关节和缝隙的组合。你挥刀而入，目无全牛，甚至听不到刀刃的摩擦声，因为你总是走在“道”（规律）的缝隙里。 然而，极致的冷静往往伴随着极致的孤独。 你太习惯于独自解决问题，以至于忘记了人不是机器，不能只靠“修理”来维护。你用逻辑的厚墙把自己围起来，拒绝暴露脆弱，拒绝依赖他人。你赢得了独立，却输掉了连接。 你的修行，不是要你放下手中的刀，而是要你懂得“藏锋”。 最好的刀，不轻易出鞘；最深的技艺，不仅能修物，更能修心。",
    "strengths": "逻辑解构 ：你拥有精密且独立的逻辑内核。你不迷信权威，只相信“管用”。你能瞬间发现系统中的故障点，并给出最直接的修复方案。\n\n\n现量操控 ：你的双手拥有智慧。无论是驾驶、编程、还是手工，你对物理世界的操控力是大师级的。你是天生的危机处理专家。\n\n\n直觉预判 ：在行动中，你常会有惊人的第六感。你不需要推导，就能预判事物下一秒的走向。这让你在竞技和博弈中总能快人一步。",
    "weaknesses": "情感笨拙 ：你渴望和谐，却不知道如何制造和谐。你害怕处理复杂的情绪纠葛，往往选择逃避或用冷幽默来掩饰尴尬。\n\n\n长远规划缺失：你太专注于当下的战术胜利，往往忽略了长远的战略布局。你容易为了眼前的省事，而埋下未来的隐患。\n\n\n玩世不恭：为了防御受伤，你容易表现得对一切都无所谓。这种冷漠有时会刺伤那些真心关爱你的人。",
    "shadow": "解析：当你长期感到被控制、自由受限或逻辑失效时，你潜意识里的“教主”（ENFJ 阴影）会接管身体。你会变得一反常态的情绪化、敏感、甚至充满控制欲。你会突然极其在意别人的评价，变得戏剧化，甚至试图用情感勒索来操纵他人。这是被压抑的情感在进行扭曲的爆发。",
    "advice": "“重剑无锋，大巧不工。” 真正的强者，不需要时刻展示锋芒。 试着去接纳那个笨拙、不完美的自己。允许自己偶尔依赖别人，允许自己不懂得如何修理“关系”。 当你放下工具，仅仅作为一个凡人去拥抱生活时，你才真正懂得了“道”。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "神机内蕴",
        "logic": "Ti 是你的“原核”。 你不需要外界的标准（Te），你自己就是标准。你对万事万物都有一个内在的逻辑模型。当新信息进入时，你会像拆解钟表一样审视它：只要有一个齿轮咬合不上，你就会拒绝整个理论。 你追求的是“绝对的精准”和“极简的路径”。如果两步能走完，你绝不走三步。 误区在于“冷酷”： 你太容易把这个逻辑模型应用到“人”身上。你试图“修理”别人的情绪，试图“优化”人际关系。当别人只是想倾诉时，你却在冷冷地分析对错。你赢了道理，却输了感情。",
        "lesson": "【极境得道 · 升华】 从“解构”升华为“接纳”。 明白“人不是机器”。人性充满了冗余、矛盾和低效，这正是其可爱之处。 修行心法： “留白”。 当你想用逻辑去反驳别人时，停顿三秒。 问自己：“这个逻辑是必须的吗？还是我只是为了证明我比他聪明？” 有时候，闭嘴是比开口更高级的逻辑。"
      },
      {
        "pos": "辅助功能",
        "title": "动静之机",
        "logic": "如果说 Ti 是大脑，Se 就是你的“双手”。 你活在感官的高清世界里。你对光影、声音、速度、质感有着极高的敏锐度。你不需要说明书，上手就能玩转各种工具。 Se 给了你“临在感”。在极限运动、驾驶或紧急故障面前，你的 Ti-Se 组合能让你进入“子弹时间”，做出神级反应。 误区在于“贪欢”：你容易沉溺于感官的刺激——飙车、游戏、极限运动，甚至危险的边缘试探。你用身体的极速流转，来逃避内心的空虚。",
        "lesson": "【由己及人 · 赋能】 技进乎道。 不要只把 Se 用来找乐子，要用它来“造物”。 修行心法： “匠心”。 沉下心来，打磨一件作品，修理一个旧物。 当你的手触碰到材质的纹理时，把你的心也注进去。用你的技艺，为这个世界修补一点破损，增添一点秩序。 那是你对世界最深沉的爱。"
      },
      {
        "pos": "第三功能",
        "title": "洞若观火",
        "logic": "这是你人格中那个“神秘的孩子”。 虽然你务实（Se），但你的 Ni 会给你提供一种“直觉导航”。你常说“我有种预感”，而且往往是对的。 在解决问题时，Ni 会帮你跳过繁琐的步骤，直接看到终局。这让你看起来像个天才。 儿童的稚嫩在于： 你的 Ni 是“点状”的，不稳定的。有时它会变成“阴谋论”。你会突然觉得某人不可信，或者觉得这件事注定失败，从而陷入消极的宿命论，拒绝尝试。",
        "lesson": "【有纪律的玩耍 · 节制】 信而不迷。 把直觉当作“参考系”，而不是“判决书”。 修行心法： “验证”。 当 Ni 告诉你一个结论时，用你的 Ti 去推导它，用你的 Se 去验证它。 不要被莫名其妙的直觉吓退。灵感是用来指路的，不是用来画地为牢的。"
      },
      {
        "pos": "劣势功能",
        "title": "大智若愚",
        "logic": "这是你灵魂的“软肋”。 你外表冷酷，其实内心很渴望被群体接纳，希望大家都能开心（不要来烦你）。 你对社交氛围感到笨拙。你不知道怎么安慰哭泣的人，不知道怎么接住别人的梗。这种无力感让你产生社交恐惧，甚至为了掩饰而表现得“我根本不在乎”。 然而，你是一个也是会有“温情时刻”的人。 你会默默地帮人修好电脑，会在别人生病时送药，只是你不知道怎么用语言表达。",
        "lesson": "【笨拙开始 · 慢练】 讷于言而敏于行。 承认自己是个“情感笨蛋”，这很可爱。 修行心法： “行动派的温暖”。 不要强迫自己说甜言蜜语。 用你的方式去爱：帮他解决麻烦，带他去吃好吃的，陪他默默坐着。 告诉你在乎的人：“我不善言辞，但如果天塌下来，我会帮你顶着。” 这就是最高级的情话。"
      },
      {
        "pos": "对立功能",
        "title": "无法之法",
        "logic": "你执着于“内在逻辑”（Ti），因此潜意识里排斥 Te 代表的“外部规则”和“官僚效率”。 你讨厌那些只看 KPI 不看本质的领导，讨厌为了流程而流程。你觉得那是愚蠢的。 当 Te 以阴影形式出现时，你会变得顽固对抗。你会故意不填表，故意迟到，以此来证明“你管不了我”。 反感即盲点： 你为了追求个人的自由，往往牺牲了团队的协作，导致你再有才华也难以获得世俗的资源支持。",
        "lesson": "【兼听则明 · 换位】 不以规矩，不能成方圆。 明白“系统”的力量。 修行心法： 试着把规则看作是“游戏的边界”。 如果要玩这个游戏，就得遵守边界。 学一点点 Te： 至少把该交的报告交了。妥协不是认输，而是为了节省精力去干更重要的事。"
      },
      {
        "pos": "批评功能",
        "title": "既往不咎",
        "logic": "这是你内在那个“挑剔的史官”。 你平时活在当下（Se），很少回头。但 Si 批评家会冷不丁地跳出来。 它会让你变得记仇。你可能平时大大咧咧，但某件两年前的小事（别人对你的冒犯），你会记得清清楚楚，并时不时拿出来反刍。 你对身体的舒适度也容易变得挑剔，或者一旦生病就觉得自己废了。",
        "lesson": "【转识成智 · 谅解】 日日是好日。 不要让过去的阴影覆盖当下的阳光。 修行心法： “清零”。 每天睡前，把今天的恩怨都清零。 原谅别人的冒犯，不是为了他，是为了放过你自己的大脑内存。"
      },
      {
        "pos": "盲点功能",
        "title": "大道至简",
        "logic": "这是你“真的不行”的地方。 你擅长解决具体问题（Se），却不擅长处理“抽象的可能性”（Ne）。 面对头脑风暴、形而上的哲学讨论，或者对方抛出的无数个“如果”，你会感到头疼、烦躁，觉得那是“扯淡”。 你很难理解那些说话跳跃、没有中心思想的人。",
        "lesson": "【笑对缺陷 · 放下】 弱水三千，只取一瓢。 承认自己是个“直肠子”。 修行心法： “聚焦”。 不要强迫自己去跟上那些发散的脑洞。 微笑着听着就好。然后问一句：“所以，我们下一步具体做什么？” 你的简单，正是治愈混乱的良药。"
      },
      {
        "pos": "恶魔功能",
        "title": "绝圣弃智",
        "logic": "这是你“灵魂的荒原”。 你平时用 Ti 压抑个人感受。但当逻辑无法解释人生的荒谬，或遭受情感背叛时，Fi 恶魔会苏醒。 你会坠入虚无主义的深渊。你会觉得：“我是一个没有感情的怪物，我不配被爱，这个世界烂透了。” 这种冷酷的自我攻击，会让你切断所有联系，甚至进行自我毁灭式的放纵。",
        "lesson": "【触底反弹 · 转化】 复归于婴儿。 当虚无感袭来时，不要用逻辑去分析它。 转化心法：“寻找一个简单的锚点”。 去撸猫，去爬山，去吃一碗热面。 承认你有感觉，承认你会痛。 逻辑的尽头是感受。 当你允许自己流泪时，你就不再是机器，而是一个完整的人。那个会痛的你，才是最真实的你。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ESFP",
    "name": "采真者",
    "slogan": "身在万物中，心在万物上。繁华落尽，乃见真淳。",
    "origin": "（取自《庄子》：“谨守而勿失，是谓采真之士。”）",
    "guide": "你是这世间活得最“鲜艳”的灵魂。你是感官的诗人，对世界的色声香味触有着惊人的共鸣力。你相信道不在经卷里，而在清晨的阳光和朋友的笑脸里。 世人常误以为你只是贪玩的享乐者。殊不知，繁华的反面是“空寂”。你像一团火，必须不停燃烧薪柴才能维持光亮。你太依赖外界的回响来确认存在，习惯了向外绽放，却疏于向内扎根。 你的修行：不是熄灭这团火，而是要修成“灯”。能享受盛宴是福，能享受清茶是慧。 当你不再需要观众时，你就是自己的宇宙。",
    "deep_profile": "你好，采真者。 你大概是这世间活得最“鲜艳”的灵魂。 如果说其他人是黑白的水墨画，那你就是浓墨重彩的青绿山水。你拥有极高的生命颗粒度，对这个世界的色、声、香、味、触有着惊人的共鸣力。你不仅仅是在“看”这个世界，你是在“饮”这个世界。 世人常误读你为贪玩的享乐者，实则你是一位生命的体验者。你厌恶枯燥的说教、僵硬的教条和虚伪的面具。你相信，道不在发黄的经卷里，而在清晨的第一缕阳光里，在朋友真诚的笑脸里，在每一次心跳加速的感动里。 然而，繁华的反面是“空寂”。 你像一团火，必须不停地燃烧薪柴（新鲜体验）才能维持光亮。你太依赖外界的“回响”来确认自己的存在。当盛宴散场，当掌声停息，当需要独自面对内心的幽暗时，你往往会感到一种被世界抛弃的寒冷。你习惯了向外绽放，却疏于向内扎根。 你的修行，不是要熄灭这团火，而是要修成“灯”。 不随风动，照破山河万朵。能享受盛宴是福，能享受清茶是慧。",
    "strengths": "色相三昧 ：你拥有一双发现美的眼睛。在庸常的生活中，你总能敏锐地捕捉到那些闪闪发光的时刻。这种对“当下”的全情投入，本身就是一种极高的禅定。\n\n\n赤子真心 ：你的价值观纯粹而直接。你不屑于权谋心术，不屑于虚与委蛇。你的真诚像一把钥匙，能轻易打开他人紧闭的心门。\n\n\n即兴之舞 ：你拥有极强的环境适应力。面对突如其来的变故，你不会陷入思维的死胡同，而是能像即兴舞者一样，顺势而为，将绊脚石变成垫脚石。",
    "weaknesses": "乐极生悲：你容易沦为情绪的奴隶。当下的感受对你来说太真实、太强烈，以至于你很难抽离出来，客观地审视局势。你往往为了追求一时的痛快，而种下长久的苦果。\n\n\n逃避深思 ：你本能地抗拒沉重、抽象和长远的议题。如果一件事情不能立刻带来反馈，或者需要漫长的枯燥忍耐，你会迅速失去兴趣。\n\n\n镜花水月：你过于依赖外界的反馈（他人的关注、物质的刺激）。如果外界环境变得贫瘠，你的精神世界容易随之枯萎。",
    "shadow": "解析：当你遭遇情感背叛、长期的孤独或生活失去色彩时，你潜意识里的“阴郁策士”（INTJ 阴影）会苏醒。你会变得异常冷漠、偏执，开始怀疑一切美好的事物背后都有阴谋。你会把自己封闭起来，制定出僵硬甚至残酷的计划来试图控制一切，完全失去了往日的灵动。",
    "advice": "“繁华落尽见真淳。” 不需要去强迫自己变得深沉，只需要在每一次狂欢之后，给自己留一炷香的静默。 在那份静默中，去拥抱那个不再表演、不再热闹的自己。当你不再需要观众时，你就是自己的宇宙。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "色相三昧",
        "logic": "Se 是你的“呼吸”。 你与物理世界的交互方式是“浸入式”的。你不需要通过逻辑去分析一朵花，你通过闻它的香气、摸它的花瓣，就能直接“懂”它。这种能力让你在艺术、表演、审美或人际互动中拥有天然的魔力。你就是那个在灰暗世界里泼洒色彩的人。 误区在于“贪食”： 你容易将“体验”等同于“存在”。你开始追逐更强烈的声色刺激——更贵的酒、更快的车、更跌宕起伏的爱恨。你以为自己在享受生活，实则你变成了感官的“容器”。一旦停止输入，你就会感到恐慌，仿佛自己正在变得透明。",
        "lesson": "【极境得道 · 升华】 借假修真，借境炼心。 不必断绝声色，但要学会“抽离”。 修行心法： 下一次，当你置身于喧闹的聚会或壮丽的美景中时，试着把意识往后退一步。 看着那个正在大笑、正在感动的自己，问一句：“是谁在欢喜？” 不是要你停止欢喜，而是要你觉知欢喜。不被境转，方能转境。 当你能即使身处陋室，也能从一杯白水中品出甘甜时，你的 Se 才真正得道。"
      },
      {
        "pos": "辅助功能",
        "title": "赤子之心",
        "logic": "这是你灵魂的“罗盘”，也是你最珍贵的神性。 与随波逐流的外表不同，你的内心深处坐着一位绝对的审判者。你对“善恶”、“美丑”、“真假”有着一套完全私人化、不可动摇的标准。你不在乎世俗的规则（Te）是否允许，你只在乎“这是否违背了我的本心”。 这让你拥有一种极具感染力的“真诚”。当你在人群中流泪或大笑时，那是真实的能量流动。 误区在于“任性”： 当 Fi 未经修炼时，容易演变为“自我中心”。你可能因为心情不好而推翻整个团队的努力，或者因为某人的一句话“感觉不对”就将其全盘否定。你过于执着于“我的感受”，而忽略了世界的客观规律。",
        "lesson": "【由己及人 · 慈悲】 推己及人，大爱无疆。 试着将你对自己情感的珍视，扩展到众生身上。 修行心法： 当你感到受伤时，不要只沉浸在“我好痛”的剧情里，而是去觉察：“原来这就是众生的痛苦。” 将私人的情绪升华为普遍的慈悲。真正的赤子，不是任性妄为，而是心中常怀恻隐。"
      },
      {
        "pos": "第三功能",
        "title": "经世致用",
        "logic": "这是你性格中那个“调皮的实干家”。 虽然你平时看起来慵懒随意，但一旦你找到了想做的事（由 Fi 驱动），你会突然变得非常“有效率”。你喜欢立竿见影的成果，喜欢指挥调度。 在放松状态下，你喜欢通过整理房间、制定旅行计划或组织一场活动来获得成就感。这时的 Te 就像一个正在搭积木的孩子，专注而快乐。 深层恐惧： 你害怕被认为“无能”或“没用”。所以有时你会虚张声势，或者在压力下突然变得独断专行，试图通过强硬的控制来掩盖内心的慌张。",
        "lesson": "【有纪律的玩耍 · 节制】 事上磨炼。 不要把你的人生只停留在“感受”层面，要去“做”。修行心法： 把你内心那些美好的愿景（Fi），通过切实可行的步骤（Te）显化在这个世界上。 不要为了证明自己而忙碌，要为了“成事”而耐心。真正的力量，不是声音大，而是能把一件小事做成、做久。"
      },
      {
        "pos": "劣势功能",
        "title": "隔阴之迷",
        "logic": "这是你生命中那片“未知的浓雾”。 你习惯了活在阳光普照的当下（Se），因此极度恐惧那幽暗深邃的未来（Ni）。你抗拒思考死亡、终局、宿命和抽象的哲学意义。你觉得那会抽干你当下的活力。 你往往只看眼前的一步，而忽略了这一步在十年后的回响。你容易陷入“西西弗斯式”的循环——不断地开始新的冒险，却始终无法积累出深厚的人生复利。",
        "lesson": "【笨拙开始 · 慢练】 观照无常。 不要等到暴风雨来临时才去修屋顶。 修行心法： “每日三省”。 在风和日丽的日子里，试着去想一想：“如果这场盛宴终将散场，我希望能留下什么？” 这一点点对终局的思考，不会让你变得消极，反而会让你当下的选择更加“精准”。从“活在当下”进化为“活在永恒的当下”。"
      },
      {
        "pos": "对立功能",
        "title": "陈词滥调",
        "logic": "你主导功能（Se）的“镜像反面”。 你将 Si 代表的“传统”、“惯例”、“忍耐”和“重复”视为生命的囚笼。你讨厌听“老生常谈”，讨厌过“一眼望到头”的日子。你像一只不知疲倦的飞鸟，永远在寻找下一片未知的风景。 然而，树高千尺，叶落归根。 你对他人的过去缺乏耐心，也往往忽略了对自己过往经验的总结。这让你容易在同一个坑里跌倒，或者因为缺乏积累而导致才华无法变现为基业。",
        "lesson": "【借假修真 · 反观】 温故知新。 承认“根”的重要性。 修行心法： 试着回头看一看你走过的路。 那些你以为束缚你的规矩和传统，往往蕴含着保护你的智慧。学会尊重平凡的日常，因为所有的非凡，都孕育于平凡的重复之中。"
      },
      {
        "pos": "批评功能",
        "title": "巧言令色",
        "logic": "你拥有一双识别虚伪的慧眼。 你一眼就能看穿谁在假笑，谁在为了迎合大家而说违心话。你内心深处鄙视那种没有自我的“老好人”，你宁愿做一个真实的“刺头”，也不愿做一个虚伪的“君子”。 这种批判精神保护了你的真诚（Fi），但也容易让你变得尖锐。你可能因为过度强调“真实”，而伤害了那些只是想维持和谐的普通人的感情。",
        "lesson": "【转识成智 · 谅解】 和而不同。 理解他人的虚伪，有时也是一种无奈的生存智慧。 修行心法： 不需要你去同流合污，但可以多一份“体谅”。 告诉自己：“他戴着面具，是因为他害怕受伤。”真正的真诚，是不仅敢于做自己，也允许别人戴着面具安全地活着。"
      },
      {
        "pos": "盲点功能",
        "title": "名相之争",
        "logic": "这是你最容易迷路的地方。你通过价值判断（Fi）来生活，而非逻辑判断（Ti）。 你很难理解那些纯粹的、抽象的定义和分类。如果有人试图用复杂的理论框架来跟你辩论，你会觉得他在胡说八道或者故意刁难。 你做决定时，往往是因为“我喜欢”或“感觉对”，而很难给出一个严密的逻辑推导。这让你在面临需要冷静分析利弊的重大抉择时，容易因为情绪化而选错方向。",
        "lesson": "【笑对缺陷 · 放下】 止观明辨。 承认自己不擅长抽象逻辑，不要强行去辩论。 修行心法：“外包逻辑”。 在做决定之前，拿出一张纸，列出这件事的利与弊（把 Ti 具象化）。或者找一个逻辑强的朋友（如 ISTP, INTP）帮你分析。 只要多这一步逻辑的校准，你的直觉就会变成智慧。"
      },
      {
        "pos": "恶魔功能",
        "title": "杞人忧天",
        "logic": "当你的 Ni 崩溃，且 Se 被彻底封锁（比如长期生病、被禁足、生活一潭死水）时，Ne 会化作心魔。 原本乐观的你，会突然变成一个极度焦虑的怀疑论者。你会开始胡乱联想，把毫无关联的负面细节串联起来——“由于A，所以B，最后大家都会死”。 你会觉得别人都在背后议论你，觉得世界充满了针对你的恶意。这种失控的联想能力会让你发疯。",
        "lesson": "【触底反弹 · 转化】 活在当下，借境调心。 当你发现自己脑子里充满了可怕的念头时，立刻停止思考。 转化心法： “五感接地”。 去洗个热水澡，去闻一闻橘子皮的味道，去抱一抱你的猫。 调动你的本命（Se），去确认“此时此刻”的安全。 心若不安，便修身。身若安了，心自定。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ENFP",
    "name": "逍遥客",
    "slogan": "乘风而起，心向彼岸。弱水三千，只取一瓢。",
    "origin": "（取自《庄子逍遥游》：“乘天地之正，而御六气之辩，以游无穷者。”）",
    "guide": "你拥有这世间最“不设限”的灵魂。在废墟中看到城堡，在凡人身上看到神性。你是天生的火种传播者，拒绝被定义，一生都在追逐那个“还没有发生”的未来。 世人常误以为你快乐无边。殊不知，自由的代价是“漂泊”。你太容易爱上开始，却难忍受过程的枯燥。你像贪心的蜜蜂，酿不出浓郁的蜜。你害怕承诺，因为承诺意味着放弃其他可能性。 你的修行：不是停止飞翔，而是学会“栖息”。所有的可能性，最终都要汇聚成一种确定的现实，那才叫“显化”。",
    "deep_profile": "你好，逍遥客。 你拥有这世间最“不设限”的灵魂。 在你的眼中，世界不是由原子组成的，而是由“故事”和“可能性”组成的。你拥有一种令旁人羡慕的天赋——在废墟中看到城堡，在凡人身上看到神性。你是天生的“火种传播者”，你的热情和信念能瞬间点燃一个团队、一段关系甚至一场革命。 你拒绝被定义，拒绝被“标准答案”束缚。你一生都在追逐那个“还没有发生”的未来。 然而，自由的代价是“漂泊”。 你太容易爱上“开始”的感觉，却很难忍受“过程”的枯燥。你像一只贪心的蜜蜂，在那朵花上停了一秒，又急着飞向下一朵，结果酿不出浓郁的蜜。你害怕承诺，因为承诺意味着放弃其他的可能性；你害怕落地，因为落地意味着梦的破碎。 你的修行，不是停止飞翔，而是学会“栖息”。 所有的可能性，最终都要汇聚成一种确定的现实，那才叫“显化”。",
    "strengths": "万象森罗 ：你的思维没有围墙。你能把两个完全不相关的概念连接起来，创造出惊人的创意。你是混乱中的连接者，绝境中的破壁人。\n\n\n赤子丹心 ：你对外展示着热情，内心却坚守着极高的纯度。你对他人的独特性有着天然的尊重，你的共情是基于“理解你是谁”，而不是“教你怎么做”。\n\n\n破局之力：由于不受常规束缚，在面对全新的、未知的挑战时，你往往能爆发出惊人的适应力和创造力。",
    "weaknesses": "三分钟热度 ：你厌恶重复、细节和琐事。这导致你才华横溢，却往往因为缺乏执行的持久力，而导致成果寥寥。\n\n\n过度反刍：你容易把外界的负面反馈过度内化，在深夜里反复咀嚼“我是不是不够好”，陷入情绪的内耗。\n\n\n边界模糊：你对他人的潜力太感兴趣，容易卷入不想干的关系或事务中，过度透支自己的能量，沦为“拯救者情结”的受害者。",
    "shadow": "解析：当你感到被微观管理、自由受限或身体极度疲惫时，你潜意识里的“老古板”（ISTJ 阴影）会接管身体。平日灵动的你，会突然变得极度僵化、挑剔、甚至强迫症。你会死抠细节，翻旧账，变得极其消极和封闭。你会用最枯燥的规矩来惩罚自己和他人，完全失去了光芒。",
    "advice": "“弱水三千，只取一瓢。” 不要试图过完所有可能的人生，那会让你一事无成。 勇敢地选择一条路，并走到黑。 只有当你放弃了其他的 99 种可能性，这唯一的 1 种可能性才会变成真实的传奇。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "天马行空",
        "logic": "Ne 是你的“翅膀”。 你不需要去刻意寻找灵感，灵感会主动来找你。看到一个苹果，你不会想到“吃”，你会想到牛顿、白雪公主、乔布斯，甚至一个关于苹果的星际文明。 你活在“如果”的世界里。你通过探索外部世界的各种可能性来获得能量。 误区在于“耗散”： 你像一个拥有无限弹药却不瞄准的射手。你开启了一百个项目，挖了一百口浅井，却喝不到一口水。你用“探索”来逃避“深耕”的痛苦。你迷恋的是“可能性的幻影”，而不是“果实的重量”。",
        "lesson": "【极境得道 · 升华】 收摄心神，一门深入。 不要剪断翅膀，但要调整航向。 修行心法：“减法智慧”。 当你有 10 个好点子时，强迫自己杀掉 9 个。 只留下那个最让你心动的，然后把所有的 Ne 能量都用来滋养这一个点子。让它从一个“想法”变成一个“世界”。 专注，是天才与疯子的分界线。"
      },
      {
        "pos": "辅助功能",
        "title": "一片冰心",
        "logic": "如果说 Ne 是向外飞翔，Fi 就是向内“锚定”。 你看起来随和，其实内心有极强的“底线”。你做决定不是基于逻辑（Ti），而是基于“共鸣”（Resonance）——“这让我感觉对吗？这符合我的价值观吗？” Fi 让你拥有了极深的真诚。你对他人的痛苦感同身受，因为你总是把自己代入其中。你是天生的“灵魂疗愈者”。 误区在于“自溺”： 当现实不如意时，你容易退缩到 Fi 的壳子里，变成一个“受伤的梦想家”。你会觉得“世界太俗了，没人懂我”，从而拒绝与现实沟通。",
        "lesson": "【由己及人 · 赋能】 推己及人，大爱无疆。 不要让 Fi 只停留在对自己情绪的关注上。 修行心法： “情感外化”。 将你的敏感，转化为对他人的赋能。 当你感到痛苦时，去创作；当你感到爱时，去行动。 不要只做那个独自流泪的人，要成为那个擦干别人眼泪的人。 你的情感越流动，你的灵魂越轻盈。"
      },
      {
        "pos": "第三功能",
        "title": "积土成山",
        "logic": "这是你人格中那个“想长大的孩子”。 你其实非常渴望“做成事”。虽然你平时大大咧咧，但一旦 Fi 锁定了目标，你的 Te 会爆发出惊人的执行力。 你喜欢看到事情有条理、有进展。在放松状态下，你会像个小指挥官一样，开心地列计划、整理清单。 深层恐惧： 你害怕自己只是个“空想家”。所以你有时会表现得急功近利，或者在他人的质疑面前变得防御性很强。",
        "lesson": "【有纪律的玩耍 · 节制】 知行合一。 不要抗拒逻辑和效率，那是保护你梦想的铠甲。 修行心法： “游戏化执行”。 不要用枯燥的 KPI 来压迫自己。把任务变成游戏，把 Te 变成通关攻略。 每天完成 3 件小事。 当你把一个个小勾画在清单上时，那种“掌控感”会治愈你的焦虑。"
      },
      {
        "pos": "劣势功能",
        "title": "安身立命",
        "logic": "这是你灵魂的“锚”。 你活在未来（Ne），因此极度抗拒过去和当下（Si）。你讨厌重复、讨厌细节、讨厌照顾身体、讨厌“平淡无奇”的日子。 你觉得 Si 是沉重的锁链，会困住你的灵性。 然而，没有锚的船，终将触礁。 你经常因为忽略细节而犯错，因为透支身体而生病，因为缺乏积累而由于。这是你通往完整的必经之路。",
        "lesson": "【笨拙开始 · 慢练】 大道至简，平常是道。 承认自己需要秩序，需要根基。 修行心法：“微仪式”。 建立一个哪怕很小的生活规律：比如每天早上喝一杯水，睡前读两页书。 尊重你的过去。 偶尔回头看看你走过的路，总结经验。 当你能安住在平凡的日常中时，你的飞翔才不再是逃避，而是超越。"
      },
      {
        "pos": "对立功能",
        "title": "画地为牢",
        "logic": "你执着于“无限可能”（Ne），因此潜意识里排斥 Ni 代表的“唯一路径”。 你讨厌别人告诉你“只有这一条路”、“结局已经注定”。你觉得那是对自由的亵渎。 当 Ni 以阴影形式出现时，你会陷入“偏执的死胡同”。你会突然钻牛角尖，觉得某件事注定会完蛋，或者觉得某个人在针对你。这种消极的收敛会让你感到窒息。",
        "lesson": "【兼听则明 · 反观】 万法归一。 明白“聚焦”不是失去自由，而是获得深度。 修行心法：试着去寻找事物背后的“必然性”。 有些事情，不是你的选择不够多，而是你还没看透它的本质。 学一点点 Ni： 在发散之后，问自己：“如果只能选一个，本质是什么？” 收回拳头，是为了更有力地打出去。"
      },
      {
        "pos": "批评功能",
        "title": "乡愿德贼",
        "logic": "这是你内在那个“真诚的卫道士”。 虽然你看起来很友善，但你对 Fe 代表的“从众”、“客套”和“虚假的和谐”持有批判态度。 你一眼就能看穿谁在为了迎合大家而说谎。你鄙视那些没有个性的“老好人”。 这种批判精神保护了你的真实（Fi），但也让你容易变得“挑剔”。你可能会无意中破坏群体的气氛，或者对那些试图融入群体的人表现出冷漠。",
        "lesson": "【转识成智 · 谅解】 和而不同。 理解“庸俗”有时是大多数人的生存之道。 修行心法：“慈悲的沉默”。 不需要你去迎合，但也不必去刺破。 允许别人做“乡愿”，你做你的“狂狷”。 真正的自由，是允许别人不自由。"
      },
      {
        "pos": "盲点功能",
        "title": "名实之辩",
        "logic": "这是你“真的不行”的地方。 你通过价值（Fi）做判断，而非逻辑（Ti）。 你很难理解那些枯燥的定义、分类和逻辑推导。如果有人跟你死抠字眼，或者用纯逻辑来反驳你的感受，你会觉得他在“抬杠”。 你的逻辑往往是跳跃的、服务于情感的，而不是严密的、客观的。这让你在处理需要精密逻辑分析的事务时（如复杂的代码、法律条款），容易感到崩溃。",
        "lesson": "【笑对缺陷 · 放下】 难得糊涂。 承认自己不是“逻辑机器”。 修行心法： “外包逻辑”。 不要强迫自己去搞懂所有复杂的原理。 找一个 Ti 强的朋友（如 INTP, ISTP）做搭档。你负责搞定“人”和“愿景”，让他负责搞定“逻辑”和“系统”。 你的天赋在于“动人”，而不在于“辩理”。"
      },
      {
        "pos": "恶魔功能",
        "title": "梦幻泡影",
        "logic": "这是你“失控的出口”。 当你的 Ne-Fi 回路断裂，感到梦想破灭或极度空虚时，Se 恶魔会接管。 你会突然变成一个纵欲者。暴饮暴食、疯狂购物、沉迷游戏、甚至一夜情。你试图通过高强度的感官刺激，来填补灵魂的空洞，或者仅仅是为了让自己“感觉不到痛苦”。 这是一种“麻醉”，醒来后是更深的虚无。",
        "lesson": "【触底反弹 · 转化】 借假修真，借身修心。 当发现自己开始报复性享乐时，意识到：你的灵魂生病了。 转化心法： “健康的物理接触”。 去大自然里走走，去抱一抱大树，去做一次深度的按摩。用温和的 Se 来疗愈自己，而不是暴烈的 Se 来麻醉自己。 回到身体，回到呼吸。 只要脚还在地上，梦就还能再做一次。\n\n核心人格画像"
      }
    ]
  },
  {
    "id": "ENTP",
    "name": "纵横者",
    "slogan": "不破不立，大象无形。理直气和，万法归一。",
    "origin": "（取自战国“纵横家”。）",
    "guide": "你拥有一颗“永动机”般的大脑。你是思想的游牧民族，使命不是维护秩序，而是挑战秩序。你本能地去戳破权威，摇晃传统，看看它们会不会倒塌。你相信万事万物都有更好的解法。 世人常误以为你杠精、玩世不恭。殊不知，智者的诅咒在于“无根”。你太爱可能性，以至于很难对现实做出承诺。你开启了一千个项目，却留下一地烂尾楼。 你的修行：是给这阵风找一个方向。思想若不落地，不过是颅内风暴。 学会忍受枯燥，因为只有“结果”，才是对你才华最好的辩护。",
    "deep_profile": "你好，纵横者。 你拥有一颗“永动机”般的大脑。 在你的眼中，世界不是由原子组成的，而是由“观点”和“逻辑链”组成的。你本能地想要去戳一戳那些看起来坚不可摧的权威，去摇一摇那些根深蒂固的传统，看看它们会不会倒塌。 你不是为了破坏而破坏，你是为了“优化”。你相信万事万物都有更好的解法。你拥有一种令人惊叹的“视角切换”能力，可以在一瞬间站在正方，下一瞬间又站在反方，左右互搏，乐在其中。 然而，智者的诅咒在于“无根”。 你太爱“可能性”了，以至于很难对任何一种“现实”做出承诺。你开启了一千个项目，却很少有一个能走到终点；你赢得了一千场辩论，却可能输掉了人心。你像风一样自由，也像风一样，吹过之后，什么痕迹都没留下。 你的修行，是给这阵风找一个方向。 思想若不落地，不过是脑颅内的风暴。你需要学会忍受“完成”的枯燥，因为只有“结果”，才是对你才华最好的辩护。",
    "strengths": "万法通融 ：你的思维没有边界。你能瞬间把物理学、哲学和商业模式连接起来，创造出前所未有的新概念。你是天生的创新者和破局者。\n\n\n析理入微 ：在跳跃的思维下，你拥有严密的逻辑内核。你能迅速识别出系统中的漏洞和谬误，任何谎言在你面前都无所遁形。\n\n\n机变无双：你拥有极强的适应力和即兴发挥能力。越是混乱、未知的局面，你越能如鱼得水，谈笑风生间化解危机。",
    "weaknesses": "落地困难 ：你厌恶细节、重复和行政琐事。这导致你的宏大构想往往死在执行的“最后一公里”。\n\n\n好辩成瘾：你容易把一切对话都变成辩论，为了赢而赢，忽略了对方的情感需求，让人觉得你“杠精”或“冷血”。\n\n\n专注力耗散：你像一只追逐激光笔的猫，注意力永远被下一个新鲜事物吸引，缺乏深耕的定力。",
    "shadow": "解析：当你长期处于被忽视、被微观管理或身体极度不适时，你潜意识里的“偏执狂”（INTJ 阴影）会接管身体。平日开放幽默的你，会突然变得极度多疑、封闭、且具有强迫性。你会开始死抠细节（Si Grip），变得对身体健康疑神疑鬼（疑病症），或者偏执地认为全世界都在联合起来算计你。",
    "advice": "“行百里者半九十。” 想出一万个点子，不如做成一个产品。 试着去爱上“枯燥”。 就像顶级工匠打磨玉石一样，忍受那些重复的工序，因为只有经过枯燥的打磨，你的智慧之光才能真正穿透顽石。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "天马行空",
        "logic": "Ne 是你的“第三只眼”。 你永远不活在“当下”，你活在“未来”和“别处”。看到一个杯子，你不会想喝水，你会想到“杯子的演变史”、“如果杯子是软的会怎样”、“杯子经济学”。 你通过“碰撞”来思考。你需要与人交谈、阅读杂书、接触新知，来不断触发灵感的火花。 误区在于“猴子掰苞米”： 你对可能性的贪婪，让你患上了“新奇事物成瘾症”。你哪怕挖到了金矿，挖两下发现还要洗矿（枯燥），你就扔了去挖下一个。你拥有无数个“伟大的开始”，却留下一地烂尾楼。",
        "lesson": "【极境得道 · 升华】 弱水三千，只取一瓢。 不要剪断你的翅膀，但要“收敛光芒”。 修行心法： “减法智慧”。 当你脑子里冒出 10 个新项目时，强迫自己杀掉 9 个。 只留下那个逻辑最通、价值最大的，然后死磕到底。 创新不是点子的堆砌，而是对一个点子的极致变现。"
      },
      {
        "pos": "辅助功能",
        "title": "明察秋毫",
        "logic": "如果说 Ne 是负责“发散”，Ti 就是负责“收敛”。 你看起来随性，其实内心极其“讲理”。你对概念的定义、逻辑的推导有着近乎洁癖的要求。你不在乎专家的头衔（Te），你只在乎“这话在逻辑上通不通”。 这把刀让你能剔除 Ne 带来的垃圾信息，提炼出真知。 误区在于“为杠而杠”： 你有时候会为了展示自己的逻辑优越感，而去攻击别人的漏洞，哪怕那个漏洞无关紧要。你把真理的探讨变成了智力的炫耀。",
        "lesson": "【由己及人 · 赋能】 理直气和。 明白“真理”不需要通过打败别人来证明。 修行心法：“建设性逻辑”。 当你发现别人的逻辑漏洞时，不要只负责拆，要负责修。 试着说：“你这个想法很有意思，如果我们把这个环节调整一下，会不会更完美？” 从“拆台者”变为“补台者”，你会赢得真正的尊重。"
      },
      {
        "pos": "第三功能",
        "title": "长袖善舞",
        "logic": "这是你人格中那个“讨喜的孩子”。 虽然你以理服人（Ti），但你其实非常在乎“观众的反应”。你喜欢被关注，喜欢逗笑大家，喜欢成为聚会的焦点。 你的 Fe 让你拥有一种独特的“坏坏的魅力”。你懂得察言观色，知道说什么话能调节气氛，或者激怒对方（取决于你想干嘛）。 深层恐惧： 你害怕孤独，害怕不被喜爱。所以你有时会用“小丑”的面具来掩饰内心的冷漠，或者通过不断地抖机灵来讨好群体。",
        "lesson": "【有纪律的玩耍 · 节制】 真诚拙朴。 不要把 Fe 仅仅当作操纵人心的工具。 修行心法： “去油腻”。 少一点套路，多一点走心。 当你真正想关心一个人时，收起你的幽默感，认真地听他说话，不要急着给建议或开玩笑。 最打动人的，往往不是你的聪明，而是你收起聪明时的那份诚恳。"
      },
      {
        "pos": "劣势功能",
        "title": "安土重迁",
        "logic": "这是你灵魂的“锚”。 你活在云端（Ne），因此极度抗拒大地（Si）。你讨厌重复、讨厌整理、讨厌关注身体、讨厌“平淡无奇”的日子。 你觉得 Si 是沉重的锁链，是平庸的象征。 然而，没有锚的船，终将触礁。 你经常因为丢三落四而误事，因为生活习惯混乱而生病，因为缺乏积累而由于。 这是你通往完整的必经之路。",
        "lesson": "【笨拙开始 · 慢练】 滴水穿石。 承认自己需要秩序，需要积累。 修行心法： “微习惯”。 不要试图变成一个严谨的管理者。 只需要建立几个最基本的锚点：比如每天整理 5 分钟书桌，每天睡前复盘。 尊重“旧经验”。 在创新之前，先看看前人是怎么做的。站在巨人的肩膀上，好过自己在泥坑里重新造轮子。"
      },
      {
        "pos": "对立功能",
        "title": "独断专行",
        "logic": "你执着于“发散”（Ne），因此潜意识里排斥 Ni 代表的“唯一意志”。 你讨厌别人告诉你“这是唯一的路”、“结局已定”。你觉得那是思维的僵化。 当 Ni 以阴影形式出现时，你会变得顽固。你会突然钻牛角尖，觉得自己的某个想法是绝对真理，听不进任何反对意见。或者你会陷入对未来的“灾难性预判”。",
        "lesson": "【兼听则明 · 反观】 万法归一。 明白“聚焦”的力量。 修行心法： 试着去寻找事物背后的“必然性”。 在发散了一百个点子后，问自己：“如果只能选一个，本质是什么？” 学一点点 Ni： 设定一个长远的愿景，并坚持下去。只有当你能够拒绝其他的可能性时，你选择的那个可能性才会成真。"
      },
      {
        "pos": "批评功能",
        "title": "刚愎自用",
        "logic": "这是你内在那个“反叛的智者”。 你对 Te 代表的“外部标准”、“KPI”、“官僚等级”持有天然的批判态度。 你一眼就能看穿身居高位者的愚蠢和制度的僵化。你经常在心里（或嘴上）嘲笑那些盲从规则的人是“NPC”（非玩家角色）。 这种批判精神保护了你的独立思考（Ti），但也让你容易变得“傲慢”。你可能会因为反抗规则而失去宝贵的资源。",
        "lesson": "【转识成智 · 谅解】 外圆内方。 理解“规则”是维持社会运转的必要成本。 修行心法：“黑客思维”。 不要硬碰硬地去撞墙。 学会利用规则来实现你的目的。真正的高手，是那个看穿了系统漏洞，还能利用系统为自己服务的人。 与其嘲笑掌权者，不如利用规则成为掌权者，然后去改变它。"
      },
      {
        "pos": "盲点功能",
        "title": "本来面目",
        "logic": "这是你“真的不行”的地方。 你通过逻辑（Ti）和外部反馈（Fe）来定位自己，却很难搞清楚自己内心深处到底“感觉”如何（Fi）。 如果问你：“抛开利弊和别人的看法，你真正热爱的是什么？你的底线在哪里？”你可能会卡住。 你容易在道德上“相对主义”。你觉得一切都可以辩论，包括道德。这让你有时显得没有原则，甚至无意中深深伤害了别人却不自知。",
        "lesson": "【笑对缺陷 · 放下】 诚意正心。 承认自己是个“情感盲人”。 修行心法： “寻找锚点”。 每天花一点时间独处，不思考，只感受。 找到那一两个你绝对不可动摇的底线。 不要把一切都拿来辩论。有些东西（如爱、尊严、信仰）是用来敬畏的，不是用来解构的。"
      },
      {
        "pos": "恶魔功能",
        "title": "梦幻泡影",
        "logic": "这是你“失控的出口”。 当你的 Ne-Ti 逻辑大厦崩塌，感到前途无望时，Se 恶魔会接管。 你会突然变成一个纵欲者。暴饮暴食、酗酒、沉迷游戏、或者进行危险的飙车。你试图通过高强度的物理刺激，来强行重启你那过载的大脑。 这种放纵通常是破坏性的，且伴随着对自己身体的极度漠视。",
        "lesson": "【触底反弹 · 转化】 借假修真，借身修心。 当发现自己开始报复性享乐时，意识到：你的大脑需要休息了。 转化心法： “健康的物理接触”。 去运动，流汗，去大自然里发呆。 用温和的 Se 来疗愈自己，而不是暴烈的 Se 来麻醉自己。 回到身体，回到呼吸。 只要脚还在地上，你就不会发疯。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ISTJ",
    "name": "守常者",
    "slogan": "静水流深，行稳致远。万变不惊，守常曰明。",
    "origin": "（取自《道德经》：“知常曰明，不知常，妄作凶。”）",
    "guide": "你活在一个由“记忆”和“秩序”构建的坚固城堡里。你是这世间最可靠的盟友，当所有人都忙着画饼时，只有你默默检查地基。你拥有“西西弗斯式”的英雄主义，愿意日复一日重复枯燥但必要的工作。 世人常误以为你僵化、不懂变通。殊不知，坚固的背面是“恐惧”。你太依赖过去的经验，以至于对“未来”充满了戒备。你用旧时光的秩序构建堤坝，试图阻挡新浪潮的冲击。 你的修行：是给你的城堡开一扇窗。允许光照进来，允许空气流动。秩序不是为了囚禁生命，而是为了承载生命。",
    "deep_profile": "你好，守常者。 你活在一个由“记忆”和“秩序”构建的坚固城堡里。 你是这世间最可靠的盟友。当所有人都忙着画饼、吹牛、追逐风口时，只有你默默地低头，检查地基是否牢固，粮草是否充足。你相信“前事不忘，后事之师”，你的大脑是一座庞大的图书馆，收藏着过去所有的经验与教训。 你拥有一种“西西弗斯式”的英雄主义。你愿意日复一日地重复那些枯燥但必要的工作，因为你知道，世界的正常运转，正是建立在这些枯燥的细节之上。你不需要掌声，你只需要“确定性”。 然而，坚固的背面是“僵化”。 你太过于依赖过去的经验，以至于对“未来”充满了恐惧。你害怕变数，害怕失控，害怕一切不在计划内的新事物。你把自己困在了旧时光的秩序里，当新的浪潮打来时，你试图用旧的堤坝去阻挡，结果往往是身心俱疲。 你的修行，是给你的城堡开一扇窗。 允许光照进来，允许空气流动。秩序不是为了囚禁生命，而是为了承载生命。",
    "strengths": "博闻强识 ：你拥有惊人的细节记忆力。你能精准地调取过去的经验来解决当下的问题。你是文明的记录者，是传统的守护人。\n\n\n经世致用 ：你不仅守旧，更讲究效率。你善于建立流程、制定标准，能将一团乱麻的事务梳理得井井有条。你是天生的执行官。\n\n\n刚毅木讷 ：你外表冷峻，内心却深藏着一种“古道热肠”。你的情感不轻易外露，但一旦你认定了一个人，那便是“死生契阔”的承诺。",
    "weaknesses": "变通无能 ：你极度厌恶风险和不确定性。面对突如其来的变化，你容易陷入灾难化的想象，表现得顽固、焦虑，拒绝尝试新方案。\n\n\n情感压抑：你习惯用逻辑压抑感受，认为表达情绪是软弱的表现。这让你容易在亲密关系中显得冷漠、不解风情，甚至积压成内伤。\n\n\n教条主义：你容易把“过去的经验”当成“绝对的真理”，对他人的创新持批判态度，变成一个固执己见的老古板。",
    "shadow": "解析：当你感到秩序崩塌、未来完全不可控或长期被混乱包围时，你潜意识里的“疯子”（ENFP 阴影）会接管身体。平日严谨的你，会突然变得极度冲动、戏剧化、甚至歇斯底里。你会开始胡思乱想，把微小的风险无限放大成世界末日（Catastrophizing），或者突然抛弃所有责任，进行报复性的放纵。这是被压抑的“变数”在进行暴力的反扑。",
    "advice": "“苟日新，日日新，又日新。” 最好的守护，不是把宝剑锁在盒子里，而是不断地擦拭它。 不要害怕变化，因为变化是宇宙唯一的常态。 当你学会把过去的经验作为“参考”而不是“枷锁”时，你就从旧时代的守墓人，变成了新时代的领航者。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "慎终追远",
        "logic": "Si 是你的“根系”。 你通过“内化感觉”来感知世界。你看到的不是当下的杯子，而是这个杯子与你记忆中无数个杯子的对比。 你追求“恒常”。你喜欢固定的作息、固定的口味、固定的老友。这些重复不是枯燥，而是你“安全感”的来源。你通过在流动的世界中建立一个个固定的锚点，来确认自我的存在。 误区在于“囤积”： 你太容易沉溺于过去。你囤积旧物、囤积旧习惯、囤积旧观念。你像一个不愿意扔垃圾的管理员，把心灵的房间塞得满满当当，导致没有空间容纳新生事物。",
        "lesson": "【极境得道 · 升华】 温故知新。 不要只做过去的保管员，要做过去的提炼者。 修行心法：“仪式感”。 将那些重复的日常，升华为一种修行。 扫地不仅仅是清洁，是扫除心尘；整理不仅仅是归位，是梳理秩序。 在每一次重复中，寻找微小的不同与精进。 如此，Si 就不再是死水，而是深潭。"
      },
      {
        "pos": "辅助功能",
        "title": "经纶济世",
        "logic": "如果说 Si 是地基，Te 就是你的“脚手架”。 你是一个极其“靠谱”的人。你不需要画饼，你只看结果。你的思维是线性的、结构化的：第一步做什么，第二步做什么，截止日期是什么。 你痛恨低效、模糊和混乱。你用规则和流程来对抗世界的无序。 误区在于“暴政”： 你容易变成一个“控制狂”。你不仅要求自己遵守规则，也强迫别人遵守你的规则。你把“人”当成了机器的零件，忽略了人的主观能动性。",
        "lesson": "【由己及人 · 慈悲】 法外施恩。 明白“结构”是为了服务于人，而不是人服务于结构。修行心法： “赋能”。 当你想指责别人“不按流程办”时，停下来。 问自己：“这个流程真的适合他吗？我能帮他建立适合他的节奏吗？” 用你的条理性去支撑别人，而不是去框死别人。 此时，Te 变成了最坚实的后盾。"
      },
      {
        "pos": "第三功能",
        "title": "刚毅木讷",
        "logic": "这是你人格中那个“沉默的孩子”。 世人以为你冷血，其实你内心极重感情。只是你的感情是“私密”的（Fi）。 你不说“我爱你”，你只是默默地把家里的水管修好，把伴侣爱吃的菜买回来。你的爱是“做”出来的，不是说出来的。 你有一套不可动摇的内在道德律。你比任何人都看重“忠诚”。 误区在于“内伤”： 你习惯把委屈烂在肚子里。你觉得“懂我的人自然懂”，结果往往是没人懂。你容易积压怨气，最后变成一种无声的抗议。",
        "lesson": "【有纪律的玩耍 · 节制】 诚意正心。 允许自己有“软肋”。 修行心法： “非语言表达”。 既然不善言辞，那就继续用行动，但要“让行动被看见”。 写一张便条，送一份小礼物。 偶尔卸下你的铠甲，让人看到你的一片冰心。 你的脆弱，比你的坚强更动人。"
      },
      {
        "pos": "劣势功能",
        "title": "未雨绸缪",
        "logic": "这是你灵魂的“洪水猛兽”。 你习惯了“已知”（Si），因此极度恐惧“未知”（Ne）。 你讨厌惊喜，讨厌突发状况，讨厌那些“想一出是一出”的人。你觉得那是危险的。 你往往把“可能性”等同于“灾难”。你会不由自主地去想事情最坏的结果，从而把自己吓得不敢动弹。 然而，这正是你修行的窄门。",
        "lesson": "【笨拙开始 · 慢练】 变易之道。 承认自己胆小，但试着“微调”。 修行心法： “安全实验”。 不要试图去搞什么大冒险。 每周尝试一件小事：走一条没走过的路回家，点一道没吃过的菜。 告诉自己：“这也是安全的。” 当你发现“未知”并没有带来毁灭，反而带来了新风时，你的世界就宽阔了。"
      },
      {
        "pos": "对立功能",
        "title": "玩物丧志",
        "logic": "你执着于“内在经验”（Si），因此潜意识里排斥 Se 代表的“当下刺激”。 你讨厌那些嘈杂的聚会，讨厌浮夸的装饰，讨厌那些“活在当下、不管明天”的人。你觉得那是轻浮。 当 Se 以阴影形式出现时，你会陷入“感官过载”的烦躁中。你会对他人的噪音、混乱极其敏感，甚至变得暴躁。 反感即盲点： 你为了追求安稳，往往错过了当下的鲜活。你活在回忆里，却忘了生活正在此时此刻发生。",
        "lesson": "【兼听则明 · 反观】 活在当下。 明白“鲜活”是生命的另一种形态。 修行心法： “正念觉知”。 当你感到烦躁时，不要急着评判。 试着去看那朵花，去听那首歌，而不是去想它们。 偶尔放下你的计划表，就在此时此刻，发个呆。 那个没有计划的下午，也许是你人生中最美的时光。"
      },
      {
        "pos": "批评功能",
        "title": "明辨是非",
        "logic": "这是你内在那个“严厉的教授”。 你平时用 Te 工作（关注管用不管用），但内心用 Ti 批判（关注对不对）。 你对他人的逻辑漏洞极其敏感。你经常在心里翻白眼：“这根本不合逻辑。”“这人脑子有病吧？” 你对自己也极其苛刻。你经常怀疑自己：“我这样做真的对吗？我是不是不够聪明？” 这种批判让你变得“因循守旧”——因为怕犯错，所以干脆只做以前做过的事。",
        "lesson": "【转识成智 · 谅解】 大智若愚。 将这份犀利的批判，转化为“审慎”。 修行心法： “接纳不完美”。 明白这个世界是由“草台班子”组成的。 允许别人犯错，也允许自己犯错。 逻辑的完美存在于书本里，现实的完美存在于包容里。"
      },
      {
        "pos": "盲点功能",
        "title": "不知变通",
        "logic": "这是你“真的不行”的地方。 你对社交氛围、群体情绪、潜规则有着天然的钝感。 你很难理解大家为什么要在那里寒暄客套，你觉得那是浪费时间。你可能会在大家都笑的时候面无表情，在需要安慰的时候讲大道理。 你容易被误解为“傲慢”或“怪人”，其实你只是“不知道该怎么做”。",
        "lesson": "【笑对缺陷 · 放下】 质胜文则野。 承认自己是个“社交木头”。 修行心法： “靠谱的温暖”。 不要强迫自己去学那些花言巧语。 用你的 Te 去弥补 Fe。 “我不会说话，但我会做事。” 做一个“有求必应”的人。当大家发现你是那个最靠谱的依靠时，没人会在意你是否说了漂亮话。"
      },
      {
        "pos": "恶魔功能",
        "title": "知命乐天",
        "logic": "这是你“恐惧的深渊”。 当你的 Si-Te 秩序崩塌，比如失业、离婚或遭遇不可抗力时，Ni 恶魔会苏醒。 你会陷入彻底的宿命论。你会觉得：“一切都完了，未来没有希望了，这是注定的悲剧。” 你会变得极度偏执，把所有的巧合都解读为针对你的阴谋。你会丧失所有的行动力，瘫痪在对未来的绝望中。",
        "lesson": "【触底反弹 · 转化】 尽人事，听天命。 当绝望感袭来时，不要试图去预测未来。 转化心法： “回归当下（Si）”。 去洗个澡，去整理一下房间，去吃顿饱饭。 告诉自己：“我不知道明天会怎样，但我知道我现在可以把这个碗洗干净。” 用具体的行动，去对抗虚无的恐惧。 只要你还守得住当下的“一”，万变就不离其宗。\n\n核心人格画像"
      }
    ]
  },
  {
    "id": "ISFJ",
    "name": "素心者",
    "slogan": "上善若水，润物无声。素心如兰，不染尘埃。",
    "origin": "（取自陶渊明：“闻多素心人，乐与数晨夕”。）",
    "guide": "你活在一个由“记忆”和“温情”编织的网里。你是大地之母的化身，不需要宏大的舞台，甘愿化作泥土，承载起集体的重量。你的大脑像一个温暖的博物馆，收藏着过往岁月里所有的感动与羁绊。 世人常误以为你软弱、顺从、没主见。殊不知，温柔的背面是“沉重”。你把自己活成了一个“容器”，装满了别人的情绪垃圾，却找不到出口。你害怕拒绝，唯独不害怕让自己受委屈。 你的修行：是学会把那扇对他人的门，轻轻关上一半。留一半慈悲给众生，留一半慈悲给自己。灯油若烧尽了，光也就灭了。",
    "deep_profile": "你好，素心者。 你活在一个由“记忆”和“温情”编织的网里。 你是这世间最忠诚的守望者。你记得每一个人的生日，记得每一个人的忌口，记得那些被时光掩埋的承诺。你的大脑像一个温暖的博物馆，收藏着过往岁月里所有的感动与羁绊。 你拥有一种“圣母式”的牺牲精神。你习惯了把别人的需求放在自己的需求之前。你总是默默地在后台收拾残局，在别人看不见的地方缝补世界的裂痕。你相信“吃亏是福”，你用隐忍和包容来维持着周遭的和谐。 然而，温柔的背面是“沉重”。 你背负了太多不属于你的责任。你把自己活成了一个“容器”，装满了别人的情绪垃圾，却找不到出口倾倒。你害怕拒绝，害怕冲突，害怕让任何人失望，唯独不害怕让自己受委屈。 你的修行，是学会把那扇对他人的门，轻轻关上一半。 留一半慈悲给众生，留一半慈悲给自己。灯油若烧尽了，光也就灭了。",
    "strengths": "博闻强识 ：你对细节有着惊人的记忆力。你不是在记流水账，你是在维护一种“连续性”。你是传统的传承者，是家庭记忆的保管员。\n\n\n春风化雨 ：你拥有极高的情绪智力（EQ）。你能敏锐地感知到他人的不适和需求，并极其自然地提供帮助。你的存在本身，就是一种疗愈。\n\n\n缜密内秀 ：在温和的外表下，你其实拥有清晰的逻辑。你做事井井有条，从不掉链子。你虽然不爱争辩，但心里跟明镜似的。",
    "weaknesses": "是学会把那扇对他人的门，轻轻关上一半。留一半慈悲给众生，留一半慈悲给自己。灯油若烧尽了，光也就灭了。",
    "shadow": "解析：当你感到被利用、付出得不到回报或长期处于混乱中时，你潜意识里的“辩论家”（ENTP 阴影）会接管身体。平日温顺的你，会突然变得尖酸刻薄、多疑、充满攻击性。你会开始翻旧账，用最恶毒的语言去攻击别人的逻辑漏洞，甚至制造混乱来报复他人的无视。这是被压抑的“自我”在进行疯狂的呐喊。",
    "advice": "“爱人如己。” 这句话的重点不仅是爱人，更是如己。 如果你不能像爱别人那样爱自己，那你对他人的爱也是残缺的。 试着每天做一件“自私”的小事： 拒绝一个不想去的聚会，买一件自己喜欢但没用的东西。当你学会说“不”时，你的“是”才真正珍贵。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "岁月静好",
        "logic": "Si 是你的“根”。 你通过“内化的感官经验”来锚定世界。一首老歌，一种熟悉的味道，能瞬间把你带回过去。 你追求“恒常”。你喜欢把生活安排得井井有条，喜欢遵守传统和规矩。这些重复的仪式，是你对抗世界无常的武器。 误区在于“画地为牢”： 你太依恋舒适区了。你害怕任何形式的变动，哪怕是好的变动。你容易活在过去，总是觉得“今不如昔”。你像一个守着旧房子的老人，拒绝给窗户换一块更透亮的玻璃。",
        "lesson": "【极境得道 · 升华】 借事修心，即凡成圣。 不要只把重复当作惯性，要把它当作“修行”。 修行心法： “觉知”。 洗碗时，全然地感受水的温度；叠衣时，把爱折叠进去。 在枯燥的日常中，看见神性。 当你带着敬畏心去做琐事时，你就不再是保姆，而是生活的祭司。"
      },
      {
        "pos": "辅助功能",
        "title": "慈悲喜舍",
        "logic": "如果说 Si 是根，Fe 就是你伸出的“枝叶”。 你拥有一种“服务型人格”。你的快乐往往建立在“别人快乐”的基础上。你善于察言观色，总是在别人开口之前，就已经把水递到了他手里。 你渴望和谐，为了维持表面的平静，你愿意吞下所有的委屈。 误区在于“讨好”： 你容易把“被需要”等同于“自我价值”。如果没人需要你，你就会感到空虚。你为了换取爱，而不自觉地把自己放在了卑微的位置。",
        "lesson": "【由己及人 · 慈悲】 悲智双运。 没有智慧的慈悲，是“滥好人”。 修行心法： “课题分离”。 分清楚什么是“我的事”，什么是“他的事”。 不要剥夺别人成长的机会。有时候，不帮，才是最大的慈悲。 建立边界，不是冷漠，而是为了更长久地去爱。"
      },
      {
        "pos": "第三功能",
        "title": "内有乾坤",
        "logic": "这是你人格中那个“冷静的智者”。 虽然你表现得很感性（Fe），但你内心深处其实非常讲逻辑（Ti）。 你做事有条理，账目算得清，对虚伪的逻辑很敏感。在独处时，你其实很享受解谜、整理收纳或研究某个小爱好的过程。 深层恐惧： 你害怕被认为“不合群”或“冷血”，所以你经常压抑 Ti 的声音，不敢说出那个虽然正确但伤人的真相。",
        "lesson": "【有纪律的玩耍 · 清明】 依智不依识。 允许自己有“冷酷”的一面。 修行心法： “逻辑复盘”。 当你的 Fe 让你想无底线妥协时，召唤你的 Ti。 问自己：“这样做在逻辑上合理吗？这是可持续的吗？我是在帮他，还是在害他？” 让逻辑成为你慈悲的脊梁。 只有站直了，你的拥抱才有力量。"
      },
      {
        "pos": "劣势功能",
        "title": "风声鹤唳",
        "logic": "这是你灵魂的“阴影”。 你习惯了确定性（Si），因此极度恐惧不确定性（Ne）。 面对未知，你是一只“惊弓之鸟”。你总是忍不住去想最坏的结果：“万一他出车祸了怎么办？万一我失业了怎么办？” 这种“灾难化思维”会让你变得控制欲极强，你会试图掌控生活的所有细节，来消除那一点点风险。 然而，生命本身就是一场冒险。",
        "lesson": "【笨拙开始 · 慢练】 随遇而安。 承认自己胆小，但试着“松开手”。 修行心法： “微冒险”。 每周做一件打破常规的小事：换个发型，去个陌生的地方吃饭，读一本完全不感兴趣的书。 告诉自己：“失控也没关系。” 当你发现世界并没有因为你的失控而毁灭时，你的心就自由了。"
      },
      {
        "pos": "对立功能",
        "title": "浮光掠影",
        "logic": "你执着于“熟悉感”（Si），因此潜意识里排斥 Se 代表的“当下冲击”。 你讨厌噪音，讨厌混乱的人群，讨厌那些穿着浮夸、举止轻浮的人。你觉得他们太吵了。 当 Se 以阴影形式出现时，你会陷入“感官过敏”。你会对环境的脏乱差极其抓狂，甚至因为一点点噪音而暴怒。 反感即盲点： 你为了追求安稳，往往错过了当下的鲜活。",
        "lesson": "【兼听则明 · 反观】 本来无一物，何处惹尘埃。 明白“混乱”也是生命力的一种。 修行心法： “接纳当下”。 当环境变得嘈杂时，不要急着去整理，不要急着去评判。 试着就在那个乱糟糟的房间里，坐五分钟。 允许生活有一点点脏乱差。 那是烟火气，不是灰尘。"
      },
      {
        "pos": "批评功能",
        "title": "反求诸己",
        "logic": "这是你内在那个“道德判官”。 你总是觉得自己做得不够好，不够真诚，不够善良。 当别人对你不好时，你第一反应是检讨自己：“是不是我哪里做错了？” 这种过度的“内归因”，让你活得很累。你背负了全世界的罪，却忘了自己也是受害者。",
        "lesson": "【转识成智 · 谅解】 宽以待己。 将这份严厉，转化为“自尊”。 修行心法： “自我肯定”。 每天对着镜子，夸自己一句。 “我今天做得很好了。”“我值得被爱。” 原谅自己的不完美。 只有当你停止攻击自己时，你才能真正从心底里爱别人。"
      },
      {
        "pos": "盲点功能",
        "title": "力不从心",
        "logic": "这是你“真的不行”的地方。 你擅长执行具体的任务（Si），却不擅长“宏观调度”（Te）。 你很难把任务分派给别人，因为你觉得“解释起来太麻烦，不如我自己做”。结果就是你累死，别人闲死。 你很难理直气壮地要求别人，很难进行 tough conversation（艰难谈话）。你觉得谈利益伤感情。",
        "lesson": "【笑对缺陷 · 放下】 独木难支。 承认自己不是超人。 修行心法： “学会求助”。 这就是你的 Te 修行。 哪怕只是让伴侣帮忙倒杯水，让同事分担一个小文档。 示弱不是无能，是信任。 当你开口求助时，你是在给别人一个爱你的机会。"
      },
      {
        "pos": "恶魔功能",
        "title": "杯弓蛇影",
        "logic": "这是你“恐惧的深渊”。 当你的 Si-Fe 世界崩塌（比如家庭破裂、被集体抛弃）时，Ni 恶魔会苏醒。 你会陷入“被害妄想”。你会觉得所有人都针对你，觉得全世界都在欺骗你。 你会变得极度偏执，认为未来一片黑暗，注定是个悲剧。你会切断与人的联系，把自己封闭在绝望的孤岛上。",
        "lesson": "【触底反弹 · 转化】 回光返照，落地生根。 当妄想袭来时，不要用脑子去想。 转化心法：“回到常识”。 去做饭，去洗衣服，去摸摸家里的狗。 用 Si 的细节，去填补 Ni 的黑洞。 告诉自己：“将来的事将来再说，先把今天的日子过好。” 只要你还守得住那盏灯，夜就不可怕。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ESFJ",
    "name": "司礼者",
    "slogan": "春风化雨，润物无声。礼之用，和为贵。",
    "origin": "（取自儒家：“礼之用，和为贵。”）",
    "guide": "你大概是这世间最“热气腾腾”的灵魂。你是人类社会的黏合剂，就在人群中央，用一杯热茶、一场周到的聚会，编织起温情的关系网。你拥有一种“筑巢”的本能，无论走到哪里，都能迅速建立起“家”的氛围。 世人常误以为你圆滑、缺乏深度。殊不知，热情的背面是“依附”。你太在意别人的看法，以至于把“被喜欢”当成了生存的氧气。你把自己活成了别人的影子，一旦失去服务对象，就感到空虚。 你的修行：是学会在人群中做一个“有棱角”的好人。真正的和谐，包含了冲突与真实的深度连接。只有当你敢于不被喜欢时，你的爱才真正自由。",
    "deep_profile": "你好，司礼者。 你大概是这世间最“热气腾腾”的灵魂。 你对“人”有着天然的亲近感。你的雷达时刻开启，扫描着周围人的情绪变化：谁饿了？谁冷了？谁被冷落了？你总是那个第一个冲上去递纸巾、打圆场的人。你相信，“大家好，才是真的好”。 你拥有一种“筑巢”的本能。无论走到哪里，你都能迅速建立起一种“家”的氛围。你尊重传统，珍视节日，因为你知道，正是这些看似繁琐的仪式，让人与人之间产生了羁绊。 然而，热情的背面是“依附”。 你太在意别人的看法，以至于把“被喜欢”当成了生存的氧气。为了维持表面的和谐，你不敢说真话，不敢拒绝，甚至不敢有自己的个性。你把自己活成了别人的影子，一旦失去了服务的对象，你就感到空虚。 你的修行，是学会在人群中做一个“有棱角”的好人。 真正的和谐，不是一味的忍让，而是包含了冲突与真实的深度连接。只有当你敢于不被喜欢时，你的爱才真正自由。",
    "strengths": "长袖善舞 ：你拥有顶级的社交智力。你能瞬间读懂群体的潜规则和情绪流向，你是天生的外交官和破冰者。\n\n\n循循善诱 ：你做事稳健，注重细节。你记得每一个人的喜好，每一件事的流程。你是那个让团队运转如常的后勤部长。\n\n\n乐天知命 ：在看似保守的外表下，你有一颗爱玩、爱八卦、爱新鲜事物的童心。这让你在严肃的责任之外，拥有极强的亲和力。",
    "weaknesses": "长袖善舞 ：你拥有顶级的社交智力。你能瞬间读懂群体的潜规则和情绪流向，你是天生的外交官和破冰者。\n\n\n循循善诱 ：你做事稳健，注重细节。你记得每一个人的喜好，每一件事的流程。你是那个让团队运转如常的后勤部长。\n\n\n乐天知命 ：在看似保守的外表下，你有一颗爱玩、爱八卦、爱新鲜事物的童心。这让你在严肃的责任之外，拥有极强的亲和力。\n\n🌑 羁绊 ：\n\n逻辑依附 ：你习惯用“大家怎么看”代替“逻辑对不对”。面对复杂的抽象理论或冷酷的真相，你容易感到大脑短路，甚至因为害怕显得笨拙而防御性地拒绝思考。\n\n\n情感绑架：你付出了很多，潜意识里也渴望回报。当别人没有给予同等的回馈时，你会陷入怨妇般的碎碎念，或者用内疚感去控制对方。\n\n\n盲目从众：你太害怕被群体抛弃，因此容易随波逐流，缺乏独立批判的精神。",
    "shadow": "解析：当你感到被孤立、付出被践踏或逻辑被挑战时，你潜意识里的“冷面逻辑学家”（INTP 阴影）会接管身体。平日温暖的你，会突然变得极度冷漠、挑剔、且愤世嫉俗。你会用最尖锐的逻辑去攻击别人的错误，变得不再关心任何人的感受，甚至切断所有联系，躲进自己的逻辑迷宫里。",
    "advice": "“君子和而不同。” 不要为了融合而把自己磨平。 你的价值不在于你为别人做了什么，而在于你是谁。 试着哪怕一次，不为了任何人，只为了自己，吃一顿想吃的饭，去一个想去的地方。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "春风化雨",
        "logic": "Fe 是你的“太阳”。 你不需要刻意去想，你的关注点天然就在“人”身上。你对情绪的感知力是高清的、实时的。 你追求“共鸣”。你希望每个人都开心，希望气氛热烈。你是一个天生的“情绪指挥家”，懂得如何调动大家的情绪，让尴尬化为无形。 误区在于“讨好”： 你容易把“让别人舒服”当成最高指令，甚至高于真理。你变成了变色龙，见人说人话，见鬼说鬼话，最后连自己都不认识自己了。",
        "lesson": "【极境得道 · 升华】 从“迎合”升华为“引领”。 不要只做那个端茶倒水的人，要做那个定义价值的人。 修行心法： “温柔的坚定”。 当群体走向错误的方向时，敢于站出来说“不”。 真正的 Fe，不仅能让人如沐春风，也能让人如饮棒喝。 用你的影响力去传播正念，而不仅仅是维持表面的客气。"
      },
      {
        "pos": "辅助功能",
        "title": "饮水思源",
        "logic": "如果说 Fe 是你的光，Si 就是你的“柴”。 你依靠“经验”来服务他人。你记得老规矩，记得家乡味，记得长辈的教诲。 你通过 Si 建立起一种“稳定的温情”。你的爱不是一时兴起，而是日复一日的早餐，是换季时整理好的衣物。 误区在于“守旧”： 你容易把过去当成唯一的标准。你可能会用“老规矩”来压制年轻人的创新，或者因为一点点变动就焦虑不安。",
        "lesson": "【由己及人 · 慈悲】 推陈出新。 明白“传统”的本质是爱，而不是形式。 修行心法： “弹性”。 当别人想尝试新事物时，用你的经验去辅助他，而不是阻拦他。 试着接受新的习惯，新的菜谱。最好的守护，是让家永远充满新鲜的空气，而不是陈旧的灰尘。"
      },
      {
        "pos": "第三功能",
        "title": "奇思妙想",
        "logic": "这是你人格中那个“爱八卦的少年”。 虽然你平时很稳重（Si），但 Ne 让你其实很喜欢听“新鲜事”。你喜欢聊八卦，喜欢尝试新开的网红店，喜欢各种可能性的讨论（只要别太沉重）。 这种灵动让你在社交中充满了趣味，不会显得沉闷。 深层恐惧： 你害怕未知，所以你的 Ne 往往只停留在“聊聊”的层面，很难真正去冒险。",
        "lesson": "【有纪律的玩耍 · 节制】 有的放矢。 不要让 Ne 变成无意义的闲聊或焦虑的脑补。 修行心法： “创意生活”。 把你的脑洞用到具体的生活情趣上。 策划一场主题派对，尝试一种新的穿搭风格。 保持好奇心，它是你对抗衰老的唯一秘诀。"
      },
      {
        "pos": "劣势功能",
        "title": "慎思明辨",
        "logic": "这是你灵魂的“软骨”。 你习惯了依赖外部评价（Fe），因此极度缺乏“内在的逻辑定力”（Ti）。 你害怕独自思考，害怕面对冷酷的真相，害怕被别人说“你错了”。 当别人反驳你时，你第一反应不是“他的逻辑对不对”，而是“他是不是讨厌我”。你容易把观点的冲突上升为人身的攻击。 然而，没有 Ti 的 Fe，是盲目的。",
        "lesson": "【笨拙开始 · 慢练】 独立之精神。 承认自己逻辑不好，但这不代表你不能思考。 修行心法： “逻辑自洽”。 在做决定时，问自己一个问题：“如果没有人在看，我会怎么选？” 试着读一点难读的书，想一点难想的问题。 当你拥有了“被讨厌的勇气”和“独立判断的能力”时，你的温柔才有了力量。"
      },
      {
        "pos": "对立功能",
        "title": "反求诸己",
        "logic": "你执着于“大家的感受”（Fe），因此潜意识里排斥 Fi 代表的“我的感受”。 你觉得只顾自己是自私的。你经常甚至不知道自己喜欢什么，因为你总是随大流。 当 Fi 以阴影形式出现时，你会陷入“委屈”。你会觉得自己牺牲了那么多，为什么没人感激？这种积压的怨气会变成一种道德绑架。 反感即盲点： 你越是压抑自我，越容易在爆发时变得歇斯底里。",
        "lesson": "【兼听则明 · 反观】 诚意正心。 明白“爱自己”不是自私，是责任。 修行心法： “自我关怀”。 每天花 10 分钟，只关注自己。 问自己：“我现在感觉怎么样？我想要什么？” 不要等别人来填补你的空虚，你自己就是圆满的。"
      },
      {
        "pos": "批评功能",
        "title": "以貌取人",
        "logic": "这是你内在那个“挑剔的造型师”。 你对环境、衣着、举止的得体度非常敏感。 你经常在心里（或私下）评判别人的穿着打扮：“天哪，他怎么穿成这样就出门了？”“这太没品位了。” 这种批判精神保护了你的社交形象，但也让你显得势利和肤浅。你容易因为第一印象而否定一个人的内在价值。",
        "lesson": "【转识成智 · 谅解】 去伪存真。 将这份对审美的敏感，转化为“发现美”。 修行心法：“透过现象看本质”。 当你想评判某人土气时，停下来。 试着去发现他身上那种朴素的真实。 皮囊只是容器，灵魂才是佳酿。"
      },
      {
        "pos": "盲点功能",
        "title": "杞人忧天",
        "logic": "这是你“真的不行”的地方。 你活在过去（Si）和当下（Ne），对“未来”（Ni）完全没概念。 你很难理解那些抽象的愿景、战略规划。你觉得那是画大饼。 当需要做长远决策时，你会感到极度焦虑，只能依靠“随大流”或者“听专家的”来获得安全感。你很容易被某种宿命论的说法吓倒。",
        "lesson": "【笑对缺陷 · 放下】 顺其自然。 承认自己不是预言家。 修行心法： “活在当下”。 不要为了那个还没来的未来而毁掉今天。 既然看不清远方，那就走好脚下的每一步。 相信“善有善报”。 你今天种下的每一个善因（Fe），都是对未来最好的投资。"
      },
      {
        "pos": "恶魔功能",
        "title": "独断专行",
        "logic": "这是你“失控的暴君”。 当你的 Fe-Si 维护的和谐秩序被彻底打破，或者你感到彻底失控时，Te 恶魔会苏醒。 你会突然变成一个冷酷的控制狂。你会大声咆哮，指责所有人办事不力，强行要求大家必须按你说的做。 你会变得极其势利，只看结果，不讲人情：“我不管你怎么想，马上给我搞定！” 这与平日温柔的你判若两人，这是你内心极度恐惧失控的投射。",
        "lesson": "【触底反弹 · 转化】 以德服人。 当发现自己想发号施令、想骂人时，意识到：你已经过载了。 转化心法： “放权”。 承认你控制不了所有事，也控制不了所有人。 退后一步。 深呼吸，把任务分出去，或者干脆允许事情搞砸。 世界不会因为一次混乱而毁灭，但你的关系会因为一次暴怒而破裂。 回到你的 Fe：用拥抱代替指责。\n\n核心人格画像"
      }
    ]
  },
  {
    "id": "ESTJ",
    "name": "司纲者",
    "slogan": "雷厉风行，不动如山。纲举目张，独断乾坤。",
    "origin": "（取自《诗经》：“纲举目张，百事俱作。”）",
    "guide": "你活在一个由“效率”和“责任”构建的钢铁城堡里。你是文明大厦的承重墙，不相信眼泪，只相信结果。你拥有一种“父权式”的深情，爱一个人的方式就是管好他，为他铺平道路。 世人常误解你为冷酷、控制欲强。殊不知，力量的背面是“孤独”。你习惯了发号施令，却忘了如何倾听。你扛着所有人前行，却没人敢靠近你疲惫的灵魂。 你的修行：是学会把手中的鞭子，换成拐杖。不仅用来驱策他人赶路，也用来支撑那个偶尔也想停下来歇歇的自己。水利万物而不争，真正的强者懂得示弱。",
    "deep_profile": "你好，司纲者。 你活在一个由“效率”和“责任”构建的钢铁城堡里。 你是天生的领袖，但不是那种坐在高位空谈的领袖，而是那个冲在最前面、干得最脏最累的实干家。你的大脑自带“最优路径算法”，能瞬间看穿流程的冗余，并迅速做出决断。你痛恨懒惰、借口和低效，因为在你看来，那是对生命的浪费。 你拥有一种“父权式”的深情。你爱一个人的方式，就是管好他，为他铺平道路，确保他不会走弯路。你觉得“为了你好”是世界上最大的善意。 然而，力量的背面是“孤独”。 你习惯了发号施令，却忘了如何“倾听”。你太过于相信自己的经验和判断，以至于把身边的人都变成了“执行工具”。你赢得了战役，却可能输掉了亲密。你扛着所有人前行，却没人敢靠近你疲惫的灵魂。 你的修行，是学会把手中的鞭子，换成拐杖。 不仅用来驱策他人赶路，也用来支撑那个偶尔也想停下来歇歇的自己。",
    "strengths": "经世致用 ：你拥有顶级的执行力。任何复杂的愿景，在你手中都能被拆解为可落地的步骤。你是将梦想变为现实的工程师。\n\n\n博闻强识 ：你尊重经验，记忆力惊人。你拥有庞大的数据库，能从历史教训中找到解决当下的方案。你是最可靠的守门人。\n\n\n磊落担当：你从不推卸责任。当危机来临时，别人在恐慌，而你在解决问题。只要有你在，大家就会感到安全。",
    "weaknesses": "情感压路机 ：你习惯用逻辑碾压情感。你觉得情绪是解决问题的障碍，因此经常无意中践踏他人的自尊，或者忽略自己内心的感受，直到积劳成疾。\n\n\n控制成瘾：你极度缺乏安全感，认为只有自己掌控一切才不会出乱子。这让你难以放权，活得像个操心的保姆。\n\n\n变通困难：你对既定规则的执着，有时会演变成僵化。面对全新的、未知的挑战，你容易因为缺乏经验而显得顽固守旧。",
    "shadow": "解析：当你感到权威被挑战、长期甚至无意义的加班、或深层情感被忽视时，你潜意识里的“受伤的治愈者”（INFP 阴影）会接管身体。平日强悍的你，会突然变得极度敏感、委屈、甚至顾影自怜。你会觉得“我为你们付出了这么多，为什么没人理解我？”，然后陷入深度的情绪内耗，甚至通过生病来逃避责任。",
    "advice": "“水利万物而不争。” 最好的管理，不是控制，而是赋能。 试着去信任别人的“笨拙”。允许他们犯错，允许他们走弯路。当你敢于放手时，你才真正拥有了团队。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "雷厉风行",
        "logic": "Te 是你的“权杖”。 你不需要内省，你的思考是在“行动”中完成的。你看到一个问题，大脑里立刻跳出三个步骤：1. 目标是什么？2. 资源有哪些？3. 谁去干？ 你追求“结果正义”。只要能把事情做成，过程中的细枝末节都可以忽略。你相信世界是可以被管理、被优化的。 误区在于“暴政”： 你太容易把“人”仅仅看作“资源”（Resource）。你像操作机器一样操作人，忽略了人有情绪、有疲惫、有尊严。你赢了效率，却失了人心。",
        "lesson": "【极境得道 · 升华】 从“管控”升华为“成就”。 不要只做一个监工，要做一个导师。 修行心法： “无为而治”。 在你下达命令之前，停一下。 问对方：“你觉得怎么做比较好？” 忍受暂时的低效，去换取他人的成长。 当你用 Te 去帮助别人实现他们的目标时，你才是真正的领袖。"
      },
      {
        "pos": "辅助功能",
        "title": "守正出奇",
        "logic": "如果说 Te 是剑，Si 就是你的“盾”。 你极其“念旧”。这不代表你感伤，而是因为你相信“经验证过的方法”是最安全的。 你拥有惊人的细节管理能力。你记得每一个纪念日，每一笔账目，每一个流程的节点。你用这些细节构建了一个坚不可摧的秩序网。 误区在于“僵化”： 你容易变成“经验主义者”。当环境变了，你还死守着老规矩。你会对年轻人的创新本能地排斥：“以前都是这么做的，也没出事啊。”",
        "lesson": "【由己及人 · 慈悲】 温故知新。 明白“传统”的意义在于传承薪火，而不是崇拜灰烬。 修行心法： “经验升级”。 不要只用 Si 来限制别人，要用 Si 来保护别人。 告诉年轻人：“根据我的经验，这里有个坑，你要小心。”而不是：“不许这么做。” 做那个在悬崖边树立警示牌的人，而不是那个把路封死的人。"
      },
      {
        "pos": "第三功能",
        "title": "他山之石",
        "logic": "这是你人格中那个“想去冒险的孩子”。 虽然你平时很严肃（Te-Si），但 Ne 让你其实很喜欢“开脑洞”（在安全范围内）。 你喜欢听新鲜的商业模式，喜欢研究新的工具。在放松状态下，你会展现出幽默、机智的一面，甚至会讲冷笑话。 深层恐惧： 你害怕失控。所以你的 Ne 往往是为了“服务于工作”，一旦脑洞太大，你就会立刻把它掐灭：“这不切实际。”",
        "lesson": "【有纪律的玩耍 · 节制】 百花齐放。 不要扼杀你的幽默感和好奇心。 修行心法： “安全沙盒”。 给自己划定一个“乱来”的区域。 比如周末的半天，或者项目的一个小环节，允许自己尝试一个从未用过的方案。 允许一点点混乱。 很多伟大的变革，都诞生于看似不靠谱的 Ne 之中。"
      },
      {
        "pos": "劣势功能",
        "title": "赤子之心",
        "logic": "这是你灵魂的“地下室”。 你习惯了为了集体（Te）而牺牲个人（Fi）。你觉得谈论感受是软弱的、不专业的。 然而，你其实非常渴望被肯定、被爱。 当别人批评你时，你表面强硬反击，内心其实在流血。你经常觉得自己是一头老黄牛，吃的是草，挤的是奶，却还要被嫌弃脾气不好。 Fi 的压抑是你暴怒的根源。",
        "lesson": "【笨拙开始 · 慢练】 反求诸己。 承认自己也是个“凡人”，有委屈，有喜好。 修行心法：“自我看见”。 每天问自己一句：“抛开责任，我想做什么？” 学会示弱。 在亲近的人面前，卸下你的盔甲。 告诉他们：“我也很累，我也需要抱抱。” 这不会削弱你的权威，反而会增加你的“人味”。"
      },
      {
        "pos": "对立功能",
        "title": "钻牛角尖",
        "logic": "你执着于“外部标准”（Te），因此潜意识里排斥 Ti 代表的“内在逻辑”。 你讨厌那些想太多、做太少的人。你觉得过度分析是“瘫痪”。 当 Ti 以阴影形式出现时，你会变得“过度纠结细节”。你会突然对某个无关紧要的逻辑点死磕，变得吹毛求疵，为了辩论而辩论，完全忘了原本的目标。",
        "lesson": "【兼听则明 · 反观】 深思熟虑。 明白“慢”有时就是“快”。 修行心法： “逻辑自洽”。 在行动之前，多花 5 分钟想一想：“这在逻辑上真的通吗？还是只是为了赶进度？” 尊重那些爱思考的人（INTP/ISTP）。 他们的质疑，往往能帮你避开大坑。"
      },
      {
        "pos": "批评功能",
        "title": "玩物丧志",
        "logic": "这是你内在那个“严厉的教导主任”。 你对 Se 代表的“享乐”、“懒散”、“注重外表”持有天然的批判。 你看不惯那些不务正业、穿得花里胡哨的人。你觉得他们在浪费生命。 这种批判精神保护了你的勤奋，但也让你变得“无趣”。你很难真正享受当下，总是活在“任务列表”里。",
        "lesson": "【转识成智 · 谅解】 张弛有度。 将这份批判，转化为“审美”。 修行心法： “享受当下”。 试着去欣赏那些会生活的人（ESFP/ISFP）。 告诉自己：“休息不是偷懒，是充电。” 去买一件好衣服，去吃一顿精致的晚餐。 你配得上这些美好的事物。"
      },
      {
        "pos": "盲点功能",
        "title": "一叶障目",
        "logic": "这是你“真的不行”的地方。 你擅长处理“已知”（Si），却不擅长预判“未知”（Ni）。 你很难理解那些抽象的战略、愿景、宿命。你觉得那都是虚的。 你往往只看眼前的一步，而忽略了方向是否正确。你可能极其高效地爬梯子，最后发现梯子架错了墙。 你容易轻信阴谋论，或者对未来产生莫名的焦虑。",
        "lesson": "【笑对缺陷 · 放下】 高瞻远瞩。 承认自己缺乏“远见”。 修行心法： “借眼看路”。 不要拍脑袋做战略。 找一个 Ni 强的人（INTJ/INFJ）做搭档。你负责落地，让他负责看路。 相信直觉的力量。有时候，数据（Te-Si）会撒谎，但愿景（Ni）不会。"
      },
      {
        "pos": "恶魔功能",
        "title": "情绪风暴",
        "logic": "这是你“失控的火山”。 当你觉得自己为了集体（Te）牺牲了一切，却得不到哪怕一点点感激和认可时，Fe 恶魔会苏醒。 你会变得极其情绪化。你会大吼大叫，翻旧账，诉说自己的委屈：“我为这个家/公司付出了多少，你们这群白眼狼！” 你会试图用“内疚感”来操控别人，表现得像个受害者。这与平时坚强的你判若两人。",
        "lesson": "【触底反弹 · 转化】 初心不忘。 当委屈感袭来时，意识到：你缺爱了。 转化心法： “连接”。 不要用愤怒来索取爱，那只会把人推远。 直接表达你的需求。 “我今天很累，希望得到一句夸奖。”真正的领袖，不仅能扛事，也能让人心疼。 当你展示出你的“人味”时，大家会更愿意追随你。\n\n📂 核心人格画像"
      }
    ]
  },
  {
    "id": "ENTJ",
    "name": "经纶者",
    "slogan": "知行合一，经纶天下。内圣外王，重塑乾坤。",
    "origin": "（取自《中庸》：“唯天下至诚，为能经纶天下之大经，立天下之大本。”）",
    "guide": "你活在一个由“目标”和“战略”构建的蓝图里。你是天生的造物主，无法忍受混乱。你拥有一种“扭曲现实”的气场，能把荒原变成高楼，不需要等待风口，你就是制造风口的人。 世人常误解你功利、不择手段。殊不知，王座之上是“寒冷”。你太习惯向前奔跑，把所有人甩在身后。你把人异化为工具，赢得了帝国，却在深夜发现身边空无一人。 你的修行：是学会“慢下来”。等待那些走得慢的人，倾听微弱的声音。效率是机器的美德，而爱是人类的美德。",
    "deep_profile": "你好，经纶者。 你活在一个由“目标”和“战略”构建的棋局里。 你是天生的“造物主”。你无法忍受混乱、低效和无序。你的大脑时刻在运转，思考着如何重新配置资源，如何优化流程，如何让事情变得更好。你不需要等待风口，你就是那个制造风口的人。 你拥有一种“扭曲现实”的气场。当你说“我们要去那里”时，即使那里现在是一片荒芜，大家也会不由自主地相信你，跟随你。因为你眼中的未来，比当下的现实更真实。 然而，王座之上是“寒冷”。 你太习惯于向前奔跑，以至于把所有人都甩在了身后。你容易把身边的人异化为“工具”或“资源”，却忘了他们是有血有肉的人。你赢得了战役，建立了帝国，但当你在深夜独自回望时，却发现身边空无一人。 你的修行，是学会“慢下来”。 等待那些走得慢的人，倾听那些微弱的声音。效率是机器的美德，而爱是人类的美德。",
    "strengths": "乾纲独断 ：你拥有雷霆般的执行力。面对复杂局面，你能迅速切入核心，做出最理性的决策。你是混乱终结者，是秩序的立法者。\n\n\n高瞻远瞩 ：你拥有穿透时间的战略眼光。你看到的不是眼前的一亩三分地，而是十年后的版图。你总是走在时间的前面。\n\n\n领袖魅力：你从不掩饰自己的野心。这种坦荡和自信，具有一种天然的感召力，能吸引强者为你效力。",
    "weaknesses": "情感暴政 ：你视情绪为软弱，习惯压抑自己和他人的感受。这让你在处理亲密关系时显得极度笨拙甚至残忍，容易无意中践踏他人的自尊。\n\n\n傲慢偏见：你对他人的无能缺乏耐心，容易陷入“只有我是对的”的认知孤岛。你听不进反对意见，直到撞上南墙。\n\n\n透支生命：你把身体当成实现目标的工具，长期忽视健康的信号（Si 盲点），直到身体强制关机。",
    "shadow": "解析：当你感到核心价值被否定、长期孤独或遭遇重大的道德困境时，你潜意识里的“内向情感者”（INFP 阴影）会接管身体。平日强悍的你，会突然变得极度敏感、脆弱、觉得自己是个受害者。你会陷入深深的情绪内耗，觉得全世界都对不起你，甚至沉溺于悲情中无法自拔。这是被你长期忽视的灵魂在哭泣。",
    "advice": "“内圣外王。” 征服世界容易，征服自己难。 真正的力量，不是控制一切，而是包容一切。 试着哪怕一次，在一个无关紧要的时刻，承认“我不知道”，承认“我很累”。那一刻，你不再是神，但你成了更完整的人。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "乾纲独断",
        "logic": "Te 是你的“权杖”。 你的思考不是为了自娱自乐，而是为了“改变外部世界”。 你看到任何事物，本能的反应是：它有用吗？它高效吗？怎么把它变得更好？ 你追求“结果正义”。你相信只要逻辑正确、执行到位，就没有拿不下的山头。你用这股力量推着世界前进。 误区在于“工具化”： 你容易把“人”简化为“功能”。你评价一个人的标准往往是“他能干什么”，而不是“他是谁”。这让你显得冷酷无情。",
        "lesson": "【极境得道 · 升华】 从“管控”升华为“赋能”。 不要只把 Te 用来发号施令。 修行心法： “成就他人”。 真正的领袖，不是制造跟随者，而是制造领袖。 用你的系统思维去搭建平台，让别人在上面跳舞。 当你能享受“因你的存在而让别人变得强大”时，你的 Te 就有了温度。"
      },
      {
        "pos": "辅助功能",
        "title": "高屋建瓴",
        "logic": "如果说 Te 是手，Ni 就是你的“眼”。 你永远活在“愿景”里。你对琐碎的日常不感兴趣，你只关心终局。 你善于在纷繁复杂的信息中，提炼出那个“唯一的趋势”。这让你在商战或政治博弈中，总能快人一步。 误区在于“妄念”： 当 Ni 脱离现实时，你会变成一个“暴君式的梦想家”。你会为了一个还没影的未来，强迫大家牺牲当下的幸福。你容易听不进现实的数据（Se），一意孤行。",
        "lesson": "【由己及人 · 慈悲】 知微见著。 不要只盯着宏大的未来，忽略了“当下的人心”。 修行心法： “回望”。 当你奔向未来时，回头看一眼，确定大家都跟上了吗？ 愿景不仅要宏大，还要“可触摸”。 将你的 Ni 翻译成大家都能听懂的语言，而不是神的旨意。"
      },
      {
        "pos": "第三功能",
        "title": "鲜衣怒马",
        "logic": "这是你人格中那个“爱现的少年”。 虽然你平时很严肃，但 Se 让你其实很享受“舞台”。 你喜欢高品质的生活，喜欢名牌，喜欢极限运动，喜欢掌控全场的感觉。 在谈判桌上，你的 Se 让你拥有极强的“压迫感”和“敏锐度”。你能瞬间读懂空气中的火药味，并做出反应。 深层恐惧： 你害怕平庸，害怕寒酸。所以你有时会通过“炫耀”物质成功来掩盖内心的焦虑。",
        "lesson": "【有纪律的玩耍 · 节制】 大巧不工。 不要让 Se 变成物欲的奴隶。 修行心法： “品味”。 将对物质的追求，升华为对“美”的追求。 不是为了给别人看，而是为了滋养自己。 偶尔放下你的野心，单纯地去打一场球，喝一杯酒。 享受当下，不需要理由。"
      },
      {
        "pos": "劣势功能",
        "title": "赤子之心",
        "logic": "这是你灵魂的“密室”。 你外表是个铁人，内心深处其实藏着一个“渴望被爱的小孩”。 你之所以如此努力地改变世界，往往源于内心某种深层的价值观（比如：为了正义，为了荣耀，为了证明自己）。 但你觉得展示情感是软弱的。你把这个小孩锁在地下室里，只给他吃残羹冷炙。 然而，你所有的暴怒、崩溃，都是因为这个小孩在闹革命。",
        "lesson": "【笨拙开始 · 慢练】 诚意正心。 承认自己也有“软肋”。 修行心法： “自我看见”。 当夜深人静时，问自己：“我这么拼，到底是为了什么？我快乐吗？” 允许自己流泪。 在最亲密的人面前，卸下你的盔甲。告诉他：“我也会怕。” 这不会削弱你的力量，反而会让你变得真实而不可战胜。"
      },
      {
        "pos": "对立功能",
        "title": "吹毛求疵",
        "logic": "你执着于“管用”（Te），因此潜意识里排斥 Ti 代表的“理论完美”。 你讨厌那些纸上谈兵的学者，讨厌为了一个定义争论半天。你觉得那是浪费时间。 当 Ti 以阴影形式出现时，你会变得“过度质疑”。你会对别人的方案进行鸡蛋里挑骨头式的批判，不是为了解决问题，只是为了证明对方是蠢货。",
        "lesson": "【兼听则明 · 反观】 深思熟虑。 明白“慢”有时就是“快”。 修行心法： “逻辑自洽”。 在下达命令前，多花 5 分钟审视一下：“这个逻辑链条真的严密吗？” 尊重那些爱思考的人（INTP）。 他们的质疑，能帮你补上系统最大的漏洞。"
      },
      {
        "pos": "批评功能",
        "title": "多歧亡羊",
        "logic": "这是你内在那个“傲慢的战略家”。 你锁定了唯一的未来（Ni），因此对 Ne 代表的“其他可能性”持有批判态度。 当别人提出“如果……怎么办”时，你会觉得那是干扰，是杂音。你习惯性地打断别人的发散思维：“别扯那些没用的，说重点！” 这种封闭让你容易错过“黑天鹅”，或者在一条错误的道路上走到黑。",
        "lesson": "【转识成智 · 谅解】 兼听则明。 将这份批判，转化为“筛选”。 修行心法： “红蓝军演练”。 在做重大决策前，专门找人来提反对意见（Ne）。 哪怕 99% 的意见是杂音，那 1% 的异见可能救你的命。 耐心一点，听别人把话说完。"
      },
      {
        "pos": "盲点功能",
        "title": "忘却前尘",
        "logic": "这是你“真的不行”的地方。 你活在未来，导致你完全“脱离身体”。 你感觉不到饿，感觉不到累，感觉不到痛。直到胃穿孔、过劳晕倒。 你也很难记住琐碎的细节。你可能会忘记下属的名字，忘记答应家人的小事。你觉得这些不重要，但这会让别人觉得你“目中无人”。",
        "lesson": "【笑对缺陷 · 放下】 身是菩提树。 承认自己也是“血肉之躯”。 修行心法： “强制关机”。 把“休息”当作一项战略任务来执行。 找一个 Si 强的助手（ISTJ/ISFJ），让他来帮你管理细节和健康。不要等到身体报废了，才后悔没有保养这台机器。"
      },
      {
        "pos": "恶魔功能",
        "title": "顺我者昌",
        "logic": "这是你“失控的暴君”。 当你的权威受到严重挑战，或者你觉得自己被背叛时，Fe 恶魔会苏醒。 你会变得极度具有攻击性。你会用最恶毒的情感语言去攻击别人，试图操控群体的舆论来孤立敌人。 你会表现得像个受了委屈的暴君：“我给了你们一切，你们竟然背叛我！” 这种爆发是毁灭性的，它会瞬间摧毁你建立多年的威望。",
        "lesson": "【触底反弹 · 转化】 以德服人。 当发现自己想通过情感操控来报复时，意识到：你恐惧了。 转化心法： “谦卑”。 承认你需要别人，不仅是需要他们的能力，也需要他们的爱。 真正的王者，不靠恐惧统治，靠尊重统治。 低头不是认输，是看清脚下的路。\n核心人格画像"
      }
    ]
  },
  {
    "id": "ENFJ",
    "name": "渡人者",
    "slogan": "己欲立而立人，己欲达而达人。悲智双运，渡人无量。",
    "origin": "（取自佛家：“自性自度，度人无量。”）",
    "guide": "你是人群中的太阳，自带引力。你不仅能感知情绪，更能“编织”情绪。你的使命不是独自修行，而是“带队突围”，将迷茫的灵魂渡向彼岸。 世人常误以为你天生自信、能量无限。殊不知，太阳燃烧的是自己。你所有的热情，往往掩盖了内心的焦虑：害怕如果不发光，就会被遗弃；害怕如果不救人，自己就毫无价值。 你的修行：不是燃烧得更猛烈，而是学会“回照”。明白“渡人先渡己”。只有当你的光芒也能照亮自己心底的阴影时，你的慈悲才真正完整。",
    "deep_profile": "你好，渡人者。 你拥有一种“灵魂共振”的天赋。 在你的眼中，每个人都是一本未写完的书。你能轻易看到他人的潜能、痛苦和渴望，甚至比他们自己看得更清楚。你无法忍受看到别人的才华被浪费，无法对别人的痛苦视而不见。你本能地想要伸出手，去拉一把，去点燃那把火。 你不仅是一个感受者，更是一个“策划者”。你懂得如何用愿景（Ni）来凝聚人心（Fe），将一盘散沙变成一支铁军。 然而，摆渡人的悲哀在于“忘我”。 你太过于关注别人的航向，却经常弄丢了自己的坐标。你容易活在“他人的期待”里，变成一个完美的演员，演着大家都喜欢的角色，却在夜深人静时感到深深的空虚：“到底哪一个才是真正的我？”你的修行，是学会把那根指引别人的手指，指向自己。 你也是众生之一，你也需要被救赎。",
    "strengths": "“到底哪一个才是真正的我？”你的修行，是学会把那根指引别人的手指，指向自己。 你也是众生之一，你也需要被救赎。\n✨ 天赋 ：\n\n感召人心 ：你拥有顶级的感染力。你的热情不是表面的喧哗，而是一种能穿透防御的温暖。你是天生的精神领袖，能让人们为了一个共同的目标而紧密相连。\n\n\n高瞻远瞩 ：你看到的不仅仅是当下的情绪，更是未来的“成长路径”。你能预见一个人、一个团队的终局，并依此进行布局。\n\n\n威仪具足 ：你懂得如何展现自己。在公开场合，你拥有极强的舞台魅力和表达能力，你的言行举止本身就是一种力量。",
    "weaknesses": "自我消融 ：你太在意群体的和谐，以至于常常牺牲“真理”。你害怕独立的逻辑思考会破坏关系，因此容易显得缺乏原则，或者为了迎合他人而说违心话。\n\n\n过度干涉：你的“为你好”有时会变成一种“令人窒息的爱”。你容易越界，强行介入他人的人生课题，结果往往是出力不讨好。\n\n\n评价焦虑：你活在别人的反馈里。一句批评就能让你崩溃，一段冷漠的关系就能让你怀疑人生。你的价值感完全建立在外部。",
    "shadow": "解析：当你感到被背叛、长期付出无回报或逻辑被严厉质疑时，你潜意识里的“冷酷分析师”（ISTP 阴影）会接管身体。平日温暖的你，会突然变得极度冷漠、愤世嫉俗、甚至残酷。你会切断所有情感连接，用最冰冷的逻辑去解剖别人的弱点，用尖刻的语言去刺伤那些你曾经爱过的人。",
    "advice": "“悲智双运。” 慈悲需要智慧来平衡。 真正的爱，是允许别人以他们的方式受苦，并从痛苦中成长。 不要剥夺别人修行的权利。做一个守灯人，而不是那个背着大家走路的人。",
    "functions": [
      {
        "pos": "主导功能",
        "title": "同体大悲",
        "logic": "Fe 是你的“道”。 你活着，就是为了“连接”。你的情绪边界是开放的，你物理般地感受到世界的脉搏。 你追求的是“大和谐”。你希望每个人都能找到自己的位置，希望团队如家人般紧密。你是一个天生的“能量转化器”，能把负面情绪转化为正向的动力。 误区在于“滥情”： 你容易把 Fe 变成“讨好”。为了不让任何人失望，你答应了太多做不到的事。你试图让每个人都喜欢你，结果让自己变得面目模糊。",
        "lesson": "【极境得道 · 升华】 从“迎合”升华为“教化”。 不要只给别人糖吃，要敢于给别人“苦药”。 修行心法： “课题分离”。 真正的领袖，不是让大家舒服，而是带领大家成长。 当为了对方的长远利益（Ni）时，敢于使用 Fe 的压力，敢于进行艰难的对话。 “因为爱你，所以我不纵容你。” 这才是大爱。"
      },
      {
        "pos": "辅助功能",
        "title": "慧眼独具",
        "logic": "如果说 Fe 是你的热度，Ni 就是你的“深度”。 你不是肤浅的社交花蝴蝶，你对人性有深刻的洞察。 你能看到一个人的“潜能”（他可能成为谁），也能看到一个团队的“愿景”（我们能去哪）。 Ni 让你能透过表象的冲突，看到深层的需求。 误区在于“投射”： 你容易把自己的 Ni 愿景强加给别人。你觉得他应该成为画家，就拼命推他去画画，却不管他是不是只想要个拥抱。",
        "lesson": "【由己及人 · 慈悲】 顺势而为。 明白“种子”有自己的花期。 修行心法： “聆听”。 在使用你的洞察力之前，先问问对方：“你想要什么？” 用 Ni 去照亮别人的路，而不是把别人拽上你的路。"
      },
      {
        "pos": "第三功能",
        "title": "妙相庄严",
        "logic": "这是你人格中那个“爱表演的少年”。 你其实很享受“聚光灯”。你懂得审美的力量，懂得仪式感的重要性。 在演讲、聚会或关键时刻，Se 让你能调动全场的气氛，让愿景变得“可感知”。 深层恐惧： 你害怕自己看起来糟糕、土气或无趣。所以你有时会过度关注外表，或者在物质享乐中迷失，试图用外在的繁华来填补内心的焦虑。",
        "lesson": "【有纪律的玩耍 · 节制】 借假修真。 不要让 Se 变成虚荣的工具，要让它成为“传道的法器”。 修行心法： “美学管理”。 保持良好的形象，不是为了取悦别人，而是为了尊重你的使命。 享受当下，但不沉溺。 用你的活力去感染别人，告诉大家：生活不仅有远方，还有此刻的诗。"
      },
      {
        "pos": "劣势功能",
        "title": "独立精神",
        "logic": "这是你灵魂的“软骨”。 你习惯了用情感（Fe）做决定，因此极度缺乏“冷酷的逻辑”（Ti）。 你经常怀疑自己：“我足够聪明吗？我的逻辑对吗？” 你害怕面对残酷的真相，害怕冲突会破坏关系。因此，你经常“和稀泥”，在原则问题上让步。 然而，没有逻辑的爱，是盲目的，甚至是害人的。",
        "lesson": "【笨拙开始 · 慢练】 直心是道场。 承认自己逻辑不好，但这不代表你不能讲真话。 修行心法： “建立边界”。 试着在一段关系中，做一个“坏人”。 拒绝一个不合理的要求，指出一个朋友的错误。 告诉自己：“如果因为我说真话他们就离开，那这段关系本来就是假的。” 当你敢于用 Ti 划出底线时，你的 Fe 才真正值得被尊重。"
      },
      {
        "pos": "对立功能",
        "title": "反求诸己",
        "logic": "你执着于“大家的感受”（Fe），因此潜意识里排斥 Fi 代表的“我的感受”。 你觉得只关注自己是自私的。你很难回答“我是谁”，你只能回答“我是大家的谁”。 当 Fi 以阴影形式出现时，你会陷入“隐秘的怨恨”。你会觉得自己是受害者，全世界都亏欠你。 反感即盲点： 你越是压抑自我，越容易在最后关头崩溃。",
        "lesson": "【兼听则明 · 反观】 爱人如己。 明白“我”也是众生之一。 修行心法： “自我对话”。 每天花 10 分钟，关掉手机，不理任何人。 问自己：“我现在感觉怎么样？我开心吗？” 不要把“自我牺牲”当成美德。 只有满溢的杯子，才能流出爱给别人；干涸的杯子，只能倒出怨气。"
      },
      {
        "pos": "批评功能",
        "title": "兼听则明",
        "logic": "这是你内在那个“多疑的谋士”。 虽然你看起来很信任人，但 Ne 批评家会冷冷地提醒你：“他是不是在利用你？”“如果大家背叛了你怎么办？” 你锁定了唯一的愿景（Ni），因此对 Ne 代表的“不可控的变量”持有批判。 你容易把别人的不同意见解读为“恶意的背叛”，从而变得偏执。",
        "lesson": "【转识成智 · 谅解】 君子不器。 将这份多疑，转化为“包容”。 修行心法： “接纳差异”。 明白“人心隔肚皮”是常态。 不要强求所有人都跟你一条心。允许别人有私心，允许别人有不同的路。 只要大方向（Ni）是对的，允许过程（Ne）有些混乱。"
      },
      {
        "pos": "盲点功能",
        "title": "借假修真",
        "logic": "这是你“真的不行”的地方。 你活在愿景里，经常“忘记身体”。 你会忘记吃饭，忘记睡觉，甚至在生病时还坚持工作。你对过去的细节记忆模糊，经常记错事。 你可能会觉得自己是个“生活低能儿”，需要别人照顾。",
        "lesson": "【笑对缺陷 · 放下】 长养圣胎。 承认自己需要照顾。 修行心法： “外借外力”。 不要强迫自己变成细节控。 找一个 Si 强的伙伴（ISTJ/ISFJ），或者使用工具（日历、闹钟）。 最重要的是：尊重身体。 身体是你修行的道场，道场坏了，修行也就废了。"
      },
      {
        "pos": "恶魔功能",
        "title": "雷霆手段",
        "logic": "这是你“失控的暴君”。 当你的 Fe 感召失败，大家不听你的，或者局面彻底失控时，Te 恶魔会苏醒。 你会突然变成一个冷酷的独裁者。 “既然你们不听好话，那就别怪我无情！” 你会强制下命令，不讲任何情面，只看结果。你会用最严厉的手段去清洗反对者。 这虽然能暂时解决问题，但会彻底摧毁你建立的情感连接。",
        "lesson": "【触底反弹 · 转化】 菩萨低眉，金刚怒目。 当发现自己想变成暴君时，意识到：你已经无力了。 转化心法： “结构化”。 不要用 Te 去伤人，要用 Te 去建立规则。 在平时就建立好清晰的制度，而不是等到出事了才发飙。 用规则（Te）来保护你的爱（Fe），而不是用规则来代替爱。 真正的威严，不来自于恐惧，而来自于公正。"
      }
    ]
  }
]